import React from 'react'

//component
import Slider from '../slider/Slider'
import IconBar from '../iconBar/IconBar'
import Banner from '../banner/Banner'
import Section from '../shared/section/Section'
import FrequentlyQuestion from '../shared/frequently-question/FrequentlyQuestion'
import BannerFooter from '../shared/banner-footer/BannerFooter'
import Layout from '../shared/Layout'

//image
import shopSlider from './../../assets/img/shop-slider.jpg'
import shopSection from './../../assets/img/shop-section.jpg'
import card1 from './../../assets/img/shop-card-1.png'
import card2 from './../../assets/img/shop-card-2.png'
import card3 from './../../assets/img/shop-card-3.png'
import shopRequest1 from '../../assets/img/shop-request-1.jpg'
import shopRequest2 from '../../assets/img/shop-request-2.jpg'
import shopRequest3 from '../../assets/img/shop-request-3.jpg'
import shopImg from '../../assets/img/shop-img.jpg'
import shopFooter from '../../assets/img/shop-footer.jpg'
import shop from '../../assets/img/new Shop.png'

const Shop = () => {
  const dataSlider = {
    img: shopSlider,
    title: 'تجربه خرید محصولات باکیفیت از اسنپ‌شاپ',
    text:
      'سوپراپلیکیشن اسنپ با راه اندازی اسنپ‌شاپ توانسته فرآیند خرید انواع کالاهای ضروری را آسان و سریع کند. مشتریان محصولات مورد نظر خود را می‌توانند در فروشگاه اسنپ جستجو و به سبد خرید خود اضافه کنند.',
    buttonText: 'خرید از فروشگاه',
    showInput: false,
    color: '#b400ae',
  }

  const dataBanner = {
    img: shopSection,
    title: 'مزایای خرید کالا از اسنپ‌شاپ',
    text:
      'اسنپ‌شاپ با ارائه راهکارهای اساسی به دنبال ساده‌سازی و سرعت بخشیدن به جریان عادی زندگی مردم است.',
    cards: [
      {
        id: 1,
        imgCard: card1,
        titleCard: 'تنوع گسترده محصولات و برندها',
        textCard:
          'اسنپ‌شاپ مجموعه گسترده‌ای از انواع محصولات آرایشی، دیجیتالی، پوشاک و سایر کالاها را در برندهای گوناگون ارائه می‌دهد.',
      },
      {
        id: 2,
        imgCard: card2,
        titleCard: 'ارائه تخفیف‌های هیجان انگیز',
        textCard:
          'در فروشگاه اسنپ تخفیف‌های ویژه روی محصولات مختلف ارائه می‌شوند که به کاربران جهت صرفه جویی در هزینه‌ها کمک شایانی می‌کنند.',
      },
      {
        id: 3,
        imgCard: card3,
        titleCard: 'پشتیبانی 24 ساعته در هفت روز هفته',
        textCard:
          'تیم پشتیبانی اسنپ‌شاپ به صورت 24 ساعته و هفت روز هفته آماده پاسخگویی به سؤالات، خواسته‌ها و نظرات کاربران عزیز است.',
      },
    ],
  }

  const dataSection = {
    requestData: [
      {
        number: 0,
        id: 'request-1',
        img: shopRequest1,
        title: 'نحوه خرید کالا',
        name: 'خرید',
        text:
          'وارد سوپراپلیکیشن اسنپ شوید. روی گزینه فروشگاه (به رنگ بنفش) کلیک کنید. سپس وارد صفحه اصلی اسنپ‌شاپ می‌شوید. اکنون می‌توانید در دسته بندی‌های مختلف جستجو کرده و محصولات خود را خریداری کنید.',
      },
      {
        number: 1,
        id: 'request-2',
        img: shopRequest2,
        title: 'انتخاب فروشنده منتخب',
        name: 'انتخاب',
        text:
          'هر یک از محصولات موجود در اسنپ‌شاپ از فروشگاه های معتبر سطح شهر عرضه می‌شوند. در زمان انتخاب محصول مورد نظر می‌توانید نام و مشخصات فروشنده را مشاهده کنید. تغییر فروشنده در محصولاتی که دارای چندین فروشنده مختلف هستند نیز امکان پذیر است.',
      },
      {
        number: 2,
        id: 'request-3',
        img: shopRequest3,
        title: 'هفت روز ضمانت بازگشت کالا',
        name: 'ضمانت',
        text:
          'مشتریان می‌توانند حداکثر تا هفت روز از زمان ثبت سفارش، از طریق تماس با پشتیبانیِ فروشگاه اسنپ درخواست مرجوع کردن سفارش خود را جهت پیگیری و اقدام اعلام کنند.',
      },
    ],
    dataCard: [
      {
        id: 1,
        title: 'ارسال کالا زیر 2 ساعت',
        text:
          'سیستم ارسال قوی اسنپ‌شاپ این امکان را برای خریداران فراهم کرده است که بتوانند به سرعت محصولات خود را دریافت کنند. کاربران می‌توانند محصولات خود را  زیر 2 ساعت تحویل بگیرند. چنین ویژگی به ندرت در فروشگاه‌های آنلاین کشور وجود دارد. اما اسنپ‌شاپ از این قابلیت برای حداکثر رضایت مشتریان خود استفاده کرده است. خریداران سفارش خود را در روز و ساعت مشخص شده دریافت می کنند.',
      },
      { id: 2, type: 'img', source: shopImg },
      {
        id: 3,
        title: 'تضمین اصالت و اعتبار کالا',
        text:
          'کلیه محصولات موجود در اسنپ‌شاپ اصل هستند و با گارانتی اصلی و معتبر عرضه می‌شوند. اسنپ‌شاپ با اعتقاد به صداقت و مشتری مداری، تلاش خود را برای ارائه کالاهای با کیفیت انجام می‌دهد. مشتریان محترم می توانند اطمینان داشته باشند که کالای خریداری شده دارای شماره سریال معتبر از کمپانی اصلی تولید کننده است.',
      },
      {
        id: 4,
        title: 'خرید کالا از بهترین فروشگاه‌های کشور',
        text:
          'اسنپ‌شاپ کالاهای مورد نیاز کاربران را از شناخته شده‌ترین فروشگاه‌های سطح شهر تهیه کرده و در سریعترین زمان ممکن به دست آنها می‌رساند. از این نظر می‌توان نسبت به کیفیت محصولات و ارسال آنها از فروشگاه معتبر اطمینان داشت.',
      },
    ],
    color: '#b400ae',
  }

  const questionData = [
    {
      id: 0,
      active: false,
      title: 'چگونه وارد فروشگاه اسنپ شویم؟',
      answer:
        'کاربران می توانند با مراجعه به سوپر اپلیکیشن اسنپ و کلیک روی گزینه بنفش «فروشگاه»، وارد فروشگاه اسنپ شده و کالاهای مورد نظر خود را از دسته بندی‌های موجود انتخاب و خریداری نمایند.',
    },
    {
      id: 1,
      active: false,
      title: 'چه نوع کالاهایی را می‌توان از فروشگاه اسنپ تهیه کرد؟',
      answer:
        'در حال حاضر امکان خرید انواع کالا از پنج دسته بندی «آرایشی بهداشتی»، «فرهنگ و هنر»، «دیجیتال»، «مد و پوشاک» و «خانه و آشپزخانه» فراهم شده است. همچنین در آینده نزدیک دسته بندی های دیگر نیز به فروشگاه اسنپ اضافه خواهد شد.',
    },
    {
      id: 2,
      active: false,
      title: 'فروشگاه اسنپ در چه شهرهایی فعال است؟',
      answer:
        'فروشگاه اسنپ در حال حاضر در شهرهای تهران، اصفهان، شیراز و مشهد فعال است و به زودی در سایر شهرها نیز فعالیت خود را آغاز خواهد کرد.',
    },
    {
      id: 3,
      active: false,
      title: 'چگونه از کد تخفیف استفاده کنیم؟',
      answer:
        'بعد از انتخاب کالاهای مورد، تکمیل سبد خرید و انتخاب آدرس، مشتری می‌تواند کد تخفیف خود را داخل باکس کد تخفیف وارد کرده و از گزینه اعمال کد استفاده کند و با پرداخت آنلاین، سفارش خود را تکمیل نماید. لازم است مشتریان به شرایط استفاده از کد تخفیف دریافت شده توجه کنند.',
    },
    {
      id: 4,
      active: false,
      title: 'زمان ارسال سفارش ها در فروشگاه اسنپ چگونه است؟',
      answer:
        'فروشگاه اسنپ روش های متنوعی را برای ارسال سفارش های مشتریان در نظر گرفته است. مشتریان علاوه بر امکان تحویل زیر دو ساعت، می‌توانند سفارش خود را در روز و ساعت مشخص شده دریافت نمایند.',
    },
    {
      id: 5,
      active: false,
      title: 'در صورت نیاز به مرجوعی سفارش دریافت شده چه باید کرد؟',
      answer:
        'در صورت مغایرت در نوع و تعداد سفارش دریافت شده، بسته بندی نامناسب، کیفیت پایین کالاها و هر موردی که منجر به عدم رضایت از کالاهای خریداری شده باشد، مشتریان می‌توانند حداکثر تا هفت روز از زمان دریافت سفارش، از طریق تماس با پشتیبانی فروشگاه اسنپ درخواست مرجوع کردن سفارش خود را جهت پیگیری و اقدام اعلام کنند.',
    },
  ]

  const dataFooter = {
    img: shopFooter,
    icon: shop,
    title: 'سفارش کالا با اسنپ شاپ',
    text:
      'هم‌اکنون خدمات سفارش کالاهای ضروری، از طریق سیستم‌عامل‌های مختلف موبایل و وب اپلیکیشن به راحتی در دسترس شماست. خرید آسان کالا را با سوپراپلیکیشن اسنپ تجربه کنید.',
    button: 'خرید از فروشگاه',
  }

  return (
    <div>
      <Layout id='0'>
        <Slider dataSlider={dataSlider} />
        <IconBar />
        <Banner dataBanner={dataBanner} />
        <Section dataSection={dataSection} />
        <FrequentlyQuestion questionData={questionData} />
        <BannerFooter dataFooter={dataFooter} />
      </Layout>
    </div>
  )
}

export default Shop
