import React from 'react'

//component
import Slider from '../slider/Slider'
import IconBar from '../iconBar/IconBar'
import Banner from '../banner/Banner'
import Section from '../shared/section/Section'
import FrequentlyQuestion from '../shared/frequently-question/FrequentlyQuestion'
import BannerFooter from '../shared/banner-footer/BannerFooter'
import Layout from '../shared/Layout'

//image
import pickupSlider from './../../assets/img/pickup-slider.jpg'
import pickupTruckSlider from './../../assets/img/pickup-truckslider.jpg'
import fast from './../../assets/img/pickup-truck-card-1.png'
import clear from './../../assets/img/pickup-truck-card-2.png'
import support from './../../assets/img/pickup-truck-card-3.png'
import truckupRequest1 from '../../assets/img/truckup-request-1.jpg'
import truckupRequest2 from '../../assets/img/truckup-request-2.jpg'
import truckupRequest3 from '../../assets/img/truckup-request-3.jpg'
import truckupImg from '../../assets/img/truckup-img.jpg'
import pickupFooter from '../../assets/img/pickup-footer.jpg'
import pickup from '../../assets/img/Pickup-new.png'

const PickupTruck = () => {
  const dataSlider = {
    img: pickupSlider,
    title: 'وانت بار اینترنتی اسنپ!',
    text:
      'سرویس وانت بار اسنپ بهترین راهکار برای جابه‌جایی وسایل و بار است. شما به‌راحتی می‌توانید از طریق سوپراپ اسنپ اقدام به ثبت درخواست جهت استفاده از این سرویس کنید.',
    buttonText: 'درخواست وانت',
    showInput: false,
    color: '#06d170',
  }

  const dataBanner = {
    img: pickupTruckSlider,
    title: 'ویژگی‌های وانت بار اینترنتی اسنپ',
    text:
      'وانت بار اینترنتی اسنپ با رویکرد توسعه هوشمندسازی شهری و ارائه راهکارهای باکیفیت و مقرون به صرفه در حیطه جابه‌جای بار راه اندازی و برای راحتی حال مشتریان و ارائه خدمات سریع و ارزان در دسترس کلیه شهروندان عزیز است.',
    cards: [
      {
        id: 1,
        imgCard: fast,
        titleCard: 'سریع و قابل اعتماد',
        textCard:
          'جابه‌جایی بار در اسنپ به لطف وجود سیستم حمل بار سریع و مطمئن، در نهایت احتیاط و توسط نیروهای باتجربه انجام می‌شود.',
      },
      {
        id: 2,
        imgCard: clear,
        titleCard: 'قیمت‌گذاری شفاف',
        textCard:
          'ساختار قیمت‌گذاری در اسنپ کاملاً شفاف است و می توانید با کمترین هزینه، بار خود را از نقطه‌ای به نقطه دیگر منتقل کنید.',
      },
      {
        id: 3,
        imgCard: support,
        titleCard: 'پشتیبانی تمام وقت',
        textCard:
          'پشتیبانی اسنپ به صورت ۲۴ ساعته و در تمام روزهای هفته، آماده کمک و پاسخ‌دهی به تمام سوالات شما است.',
      },
    ],
  }

  const dataSection = {
    requestData: [
      {
        number: 0,
        id: 'request-1',
        img: truckupRequest1,
        title: 'درخواست وانت بار اسنپ',
        name: 'درخواست وانت',
        text:
          'ابتدا وارد سوپراپ اسنپ شوید و آیکن وانت بار را انتخاب و سفارش جدید خود را ثبت کنید. اکنون وارد صفحه‌ای می‌شوید که باید مبدأ، مقصد و نوع وانت را مشخص کنید.',
      },
      {
        number: 1,
        id: 'request-2',
        img: truckupRequest2,
        title: 'ثبت همزمان چند درخواست',
        name: 'ثبت درخواست',
        text:
          'می‌توانید در زمان ثبت سفارش وانت بار، از قابلیت ثبت همزمان چند سفارش استفاده کنید. بعد از ثبت اولین سفارش می‌توانید سفارش‌های بعدی خود را یکی پس از دیگری ثبت کنید.',
      },
      {
        number: 2,
        id: 'request-3',
        img: truckupRequest3,
        title: 'ثبت مقصدهای مختلف',
        name: 'ثبت مقصد',
        text:
          'امکان انتخاب چند مقصد مختلف در اپلیکیشن اسنپ وجود دارد. شما می‌توانید تعدادی از بارهای خود را به یک مسیر و تعدادی دیگر را به مسیر دیگری منتقل کنید. این قابلیت می‌تواند در کاهش زمان و سرعت جابه‌جایی بار کمک شایانی کند.',
      },
    ],
    dataCard: [
      {
        id: 1,
        title: 'انتقال وسایل و بار با اسنپ',
        text:
          'اگر در حال جابه‌جایی وسایل خانه خود هستید یا می‌خواهید وسیله‌ای سنگین را از محل کار خود به نقطه‌ای از شهر انتقال دهید، وانت بار آنلاین اسنپ بهترین انتخاب ممکن است. بنابراین، هیچ‌گونه محدودیتی نسبت به نوع کاربری ساختمان جهت انتقال بار وجود ندارد و کلیه مشتریان می‌توانند وسایل خود را از منزل، شرکت یا مغازه خود به مکان دیگری منتقل کنند. جابه‌جایی بار با سرویس وانت‌بار اسنپ تا سقف ۱۵میلیون تومان تضمین می‌شود.',
      },
      { id: 2, type: 'img', source: truckupImg },
      {
        id: 3,
        title: 'وانت بار در تهران و سراسر کشور',
        text:
          'درخواست اینترنتی وانت سبک اسنپ در شهرهای تهران، کرج، شیراز، مشهد، اصفهان، اهواز، تبریز، قم، کرمان، گیلان، ارومیه، همدان، گرگان، هرمزگان، اراک، قزوین، کرمانشاه، مازندران، بیرجند، زنجان، بجنورد اردبیل، خرم‌آباد، سنندج و بوشهر امکان‌پذیر است. همچنین، می‌توان از سرویس وانت سنگین اسنپ در شهرهای تهران، کرج، شیراز، مشهد، اصفهان، قم، تبریز و اهواز نیز از طریق سوپراَپ اسنپ استفاده کرد. امکان درخواست سرویس وانت بین‌استانی در اپلیکیشن اسنپ فراهم است؛ جزئیات بیشتر در مورد شهرهای تحت پوشش را در ',
      },
      {
        id: 4,
        title: 'امکان انتخاب نوع وانت',
        text: `در سرویس وانت اینترنتی اسنپ امکان استفاده از چهار نوع وانت بار وجود دارد:
       1. وانت سبک (وانت پراید و وانت پیکان): مناسب برای جابه‌جایی بار تا 500 کیلوگرم است.
       2. وانت سبک مسقف: برای محافظت از بار در برابر آفتاب یا باران کاربرد دارد.
       3. وانت سبک کفی‌دار: مناسب برای جابه‌جایی بهتر و جلوگیری از آسیب به مبلمان و اثاثیه منزل است.
       4. وانت سنگین (نیسان): مناسب برای بارهای سنگین و حجیم است. در صورتی که بار بیش از 500 کیلوگرم تا 3800 کیلوگرم باشد، ما استفاده از سرویس وانت سنگین را پیشنهاد می‌کنیم.`,
      },
    ],
    color: '#00d170',
  }

  const questionData = [
    {
      id: 0,
      active: false,
      title: 'خدمات وانت بار اسنپ شامل چه مواردی می‌‍شود؟',
      answer:
        'این خدمات شامل حمل بار، وسایل و اثاثیه از منزل یا محل کار است. انتخاب نوع وانت، استفاده از کمک راننده برای جابه‌جایی بار، پشتیبانی 24 ساعته و بسیاری موارد دیگر، از جمله خدمات سوپراَپ وانت اسنپ هستند.',
    },
    {
      id: 1,
      active: false,
      title: 'سرویس وانت اسنپ دارای چند نوع وانت است؟',
      answer:
        'در سوپراپ اسنپ می‌تواند نوع وانت را براساس نیازهای شخصی انتخاب کرد. وانت‌های اسنپ به انواع وانت سبک، وانت سبک مسقف، وانت سبک کفی‌دار و وانت سنگین تقسیم می‌شوند.',
    },
    {
      id: 2,
      active: false,
      title: 'آیا سرویس وانت بار اسنپ خدمات بسته بندی دارد؟',
      answer: 'خیر، این سرویس تنها مسئولیت حمل و نقل بار را بر عهده دارد.',
    },
    {
      id: 3,
      active: false,
      title: 'سرویس وانت بار اسنپ در چه شهرهایی فعال است؟',
      answer:
        'وانت سبک اسنپ به شهرهای تهران، کرج، شیراز، مشهد، اصفهان، اهواز، تبریز، قم، کرمان، گیلان، ارومیه، همدان، گرگان، هرمزگان، اراک، قزوین، کرمانشاه، مازندران، بیرجند، زنجان، بجنورد اردبیل، خرم‌آباد، سنندج و بوشهر خدمات رسانی می‌کند. همچنین، می‌توان از سرویس وانت سنگین اسنپ در شهرهای تهران، کرج، شیراز، مشهد، اصفهان، قم، تبریز و اهواز نیز استفاده کرد.',
    },
    {
      id: 4,
      active: false,
      title: 'آیا تیم باربری اسنپ پروتکل‌های بهداشتی را رعایت می‌کند؟',
      answer:
        'بله، همۀ اعضای تیم باربری اسنپ از ماسک، دستکش و مواد ضدعفونی کننده استفاده می‌کنند.',
    },
    {
      id: 5,
      active: false,
      title: 'منظور از قیمت ثابت در اسنپ چیست؟',
      answer:
        'کرایه نهایی در اسنپ ثابت و بدون تغییر است. با طی کردن مراحل ثبت نام و انتخاب مبدأ و مقصد و نوع وانت، می‌توانید از قیمت نهایی حمل بار مطلع شوید.',
    },
    {
      id: 6,
      active: false,
      title: 'آیا امکان ردیابی وانت بار از مبدأ تا مقصد وجود دارد؟',
      answer: 'بله، از طریق سوپراپ اسنپ می‌توانید حرکت وانت را ردیابی کنید.',
    },
    {
      id: 7,
      active: false,
      title: 'نحوه پرداخت مبلغ حمل بار چگونه است؟',
      answer:
        'می‌توانید به صورت نقدی و یا آنلاین مبلغ را پرداخت کنید. همچنین، امکان پرداخت از طرف مقصد نیز وجود دارد.',
    },
  ]

  const dataFooter = {
    img: pickupFooter,
    icon: pickup,
    title: 'سرعت، اطمینان و کیفیت با وانت بار اینترنتی اسنپ',
    text:
      'هم‌اکنون سرویس وانت بار اینترنتی اسنپ، از طریق سیستم‌عامل‌های مختلف موبایل و وب اپلیکیشن به راحتی در دسترس شماست. بهترین خدمات حمل و نقل بار را با سوپر اپلیکیشن اسنپ تجربه کنید.',
    button: 'درخواست وانت',
  }

  return (
    <div>
      <Layout id='0'>
        <Slider dataSlider={dataSlider} />
        <IconBar />
        <Banner dataBanner={dataBanner} />
        <Section dataSection={dataSection} />
        <FrequentlyQuestion questionData={questionData} />
        <BannerFooter dataFooter={dataFooter} />
      </Layout>
    </div>
  )
}

export default PickupTruck
