import React from 'react'

//component
import Slider from '../slider/Slider'
import IconBar from '../iconBar/IconBar'
import Banner from '../banner/Banner'
import Section from '../shared/section/Section'
import FrequentlyQuestion from '../shared/frequently-question/FrequentlyQuestion'
import BannerFooter from '../shared/banner-footer/BannerFooter'
import Layout from '../shared/Layout'

//image
import busTicketSlider from './../../assets/img/bus-ticket-slider.jpg'
import busTicketSection from './../../assets/img/bus-ticket-section.jpg'
import card1 from './../../assets/img/bus-card-1.png'
import card2 from './../../assets/img/bus-card-2.png'
import card3 from './../../assets/img/bus-card-3.png'
import busRequest1 from '../../assets/img/bus-request-1.jpg'
import busRequest2 from '../../assets/img/bus-request-2.jpg'
import busRequest3 from '../../assets/img/bus-request-3.jpg'
import busImg from '../../assets/img/bus-img.jpg'
import busFooter from '../../assets/img/bus-footer.jpg'
import bus from '../../assets/img/bus.png'

const BusTicket = () => {
  const dataSlider = {
    img: busTicketSlider,
    title: 'خرید بلیط اتوبوس اسنپ',
    text:
      'سوپراپلیکیشن اسنپ امکان خرید اینترنتی بلیط اتوبوس را فراهم ساخته است. استرس تهیه بلیط و هیاهوی ترمینال را فراموش کنید و با خیالی راحت بلیط سفر خود را تهیه کنید.',
    buttonText: 'خرید بلیط اتوبوس',
    showInput: false,
    color: '#ff4340',
  }

  const dataBanner = {
    img: busTicketSection,
    title: 'مزایای خرید اینترنتی بلیط اتوبوس از اسنپ',
    text:
      'با تهیه بلیط به صورت آنلاین این امکان وجود دارد تا نوع اتوبوس (ویژه یا معمولی) و محل صندلی خود را مشخص کنید. همچنین امکان بررسی روزها و ساعات حرکت اتوبوس‌ها نیز در هر لحظه مهیا است.',
    cards: [
      {
        id: 1,
        imgCard: card1,
        titleCard: 'امکان رزرو سریع بلیط اتوبوس',
        textCard:
          'در هر زمان و هر مکان می‌توانید به سوپراپلیکیشن اسنپ وصل شده و به سرعت بلیط اتوبوس خود را رزرو کنید.‏',
      },
      {
        id: 2,
        imgCard: card2,
        titleCard: 'تنوع در نوع بلیط و انتخاب صندلی',
        textCard:
          'در زمان خرید آنلاین بلیط می‌توانید نوع بلیط (‏VIP‏ و معمولی) و صندلی مورد نظر خود را از روی پلن اتوبوس انتخاب کنید.‏',
      },
      {
        id: 3,
        imgCard: card3,
        titleCard: 'پشتیبانی تمام وقت',
        textCard:
          'پشتیبانی اسنپ به صورت ۲۴ ساعته و در تمام روزهای هفته، آماده کمک و پاسخ‌دهی به تمام سوالات شما است.',
      },
    ],
  }

  const dataSection = {
    requestData: [
      {
        number: 0,
        id: 'request-1',
        img: busRequest1,
        title: 'نحوه رزرو بلیط اتوبوس',
        name: 'رزرو بلیط',
        text:
          'وارد سوپراپ اسنپ شوید. گزینۀ «بلیط سفر» را انتخاب کنید. سپس چهار گزینه برای شما ظاهر می‌شوند. گزینۀ اتوبوس را ‏انتخاب کرده تا وارد صفحه اصلی این سرویس شوید. با مشخص کردن مبدأ، مقصد و تاریخ سفر می‌توانید لیستی از شرکت‌های ‏اتوبوسرانی را به همراه پایانه، تعاونی، قیمت، ظرفیت و ساعت حرکت مشاهده کنید.',
      },
      {
        number: 1,
        id: 'request-2',
        img: busRequest2,
        title: 'فیلترهای در دسترس',
        name: 'انتخاب دقیق',
        text:
          'بعد از مشاهده لیست شرکت‌های اتوبوسرانی، می‌توانید از فیلترهای ارزان‌ترین، گران‌ترین، بیشترین تخفیف، زودترین و دیرترین ساعت را برای راحتی هر چه بیشتر خود در انتخاب بلیط در نظر داشته باشید.',
      },
      {
        number: 2,
        id: 'request-3',
        img: busRequest3,
        title: 'قوانین استرداد بلیط اتوبوس',
        name: 'استرداد بلیط',
        text:
          'بعد از انتخاب گزینه مورد نظر خود، اکنون وارد صفحه‌ای می‌شوید که قوانین و شرایط استرداد بلیط وجود دارد. شرکت‌های اتوبوسرانی قوانین مختص به خود را دارند و لازم است شما با مطالعه این قوانین، در خرید بلیط آنلاین آگاهانه تصمیم بگیرید.',
      },
    ],
    dataCard: [
      {
        id: 1,
        title: 'سیر و سفر با اتوبوس',
        text:
          'سفر با اتوبوس، همچنان از جمله راهکارهایی است که مسافران باتوجه به سلیقه و امکانات موجود از آن استفاده می‌کنند. برخی مسافران برای گردش و لذت بردن از طول مسیر در راه رسیدن به مقصد، ترجیح می‌دهند با اتوبوس سفر کنند و برخی دیگر از مسافران برای کار و تجارت و مقرون به صرفه بودن هزینه‌های سفر با اتوبوس، آن را انتخاب می‌کنند. همچنین در دسترس بودن این وسیله در ساعات مختلف به مقصدهای گوناگون نیز از دیگر دلایل انتخاب مسافران است.',
      },
      { id: 2, type: 'img', source: busImg },
      {
        id: 3,
        title: 'سفر با تخفیف‌های هیجان انگیز',
        text:
          'با خرید بلیط اتوبوس از اسنپ علاوه بر اینکه امکان انتخاب بلیط از میان رنج قیمت‌های مختلف را در اختیار دارید، همواره بعد از هر سفر امتیازات ویژه‌ای را دریافت می‌کنید که سفر بعدی شما را با تخفیف‌ همراهی خواهد کرد. این امتیازات در باشگاه‌های مشتریان اسنپ در دسترس هستند و می‌توانید برای انواع بلیط و روز هتل از آن استفاده کنید.',
      },
      {
        id: 4,
        title: 'سفر به هر سوی ایران',
        text:
          'جاده‌های کشور در هر چهار سوی ایران آماده پذیرایی از شما هستند. ما در اسنپ امکان تهیه بلیط اتوبوس را برای مبدا و مقصد در شهرهای تهران، مشهد، اصفهان، شیراز و تبریز آماده کرده‌ایم و به زودی دیگر شهرهای کشور نیز اضافه خواهند شد.',
      },
    ],
    color: '#ff4340',
  }

  const questionData = [
    {
      id: 0,
      active: false,
      title: 'بعد از خرید اینترنتی بلیط اتوبوس چطور آن را دریافت کنم؟',
      answer:
        'اسنپ شماره بلیط و مشخصات اتوبوس و سفرتان را از طریق پیامک و ایمیل و در قالب یک فایل (PDF) برای شما ارسال می‌کند. شما چند دقیقه قبل از حرکت اتوبوس به دفتر شرکت اتوبوسرانی که در ترمینال قرار دارد، مراجعه می‌کنید و با اعلام شماره بلیط، بلیط کاغذی‌تان را دریافت می‌کنید.',
    },
    {
      id: 1,
      active: false,
      title:
        'آیا برای کودکان و اطفال زیر ۲ سال هم باید بلیط اتوبوس خریداری کرد؟',
      answer:
        'برای هر فردی که روی صندلی می‌نشیند و صندلی به او اختصاصی داده می‌شود، باید بلیط تهیه کند. در مواقعی که کودک زیر ۲ سال در آغوش والدین است، نیازی به خرید بلیط نخواهد بود.',
    },
    {
      id: 2,
      active: false,
      title: 'مدارک مورد نیاز برای سوار شدن به اتوبوس چیست؟',
      answer:
        'برای سوار شدن به اتوبوس به کارت شناسایی و بلیط (چاپ شده) نیاز است.',
    },
    {
      id: 3,
      active: false,
      title: 'آیا می‌توان بلیط اتوبوس را تغییر داد یا جابه‌جا کرد؟',
      answer:
        'امکان اصلاح نام، نام‌خانوادگی، تغییر تاریخ بلیط یا تعویض جای صندلی وجود ندارد. در صورت خرید اشتباه، بلیط مورد نظر باید باطل شده و بلیط جدید تهیه شود.',
    },
    {
      id: 4,
      active: false,
      title:
        'آیا با خرید اینترنتی بلیط اتوبوس به مسافرها بیمه مسافرتی تعلق می‌گیرد؟',
      answer:
        'بله. هزینه‌ای که مسافر بابت خرید بلیط اتوبوس پرداخت می‌کند بیمه مسافرتی را هم شامل می‌شود. فقط باید بدانید که نام مسافری را که هنگام خرید وارد میکنید مطابق با شناسنامه مسافر باشد. در این صورت بیمه مسافرتی به مسافرهای تمامی صندلی‌هایی که با این نام خریداری شده‌اند، تعلق می‌گیرد.',
    },
    {
      id: 5,
      active: false,
      title: 'امکان حمل حیوانات خانگی در داخل اتوبوس وجود دارد؟',
      answer:
        'طبق قوانین سازمان حمل و نقل امکان حمل حیوانات زنده در اتوبوس وجود ندارد.',
    },
  ]

  const dataFooter = {
    img: busFooter,
    icon: bus,
    title: 'خرید بلیط اتوبوس از اسنپ',
    text:
      'هم‌اکنون خدمات فروش بلیط اتوبوس، از طریق سیستم‌عامل‌های مختلف موبایل و وب اپلیکیشن اسنپ به راحتی در دسترس شماست. سیر و سفر را با خدمات گردشگری اسنپ تجربه کنید.',
    button: 'خرید بلیط اتوبوس',
  }

  return (
    <div>
      <Layout id="0">
        <Slider dataSlider={dataSlider} />
        <IconBar />
        <Banner dataBanner={dataBanner} />
        <Section dataSection={dataSection} />
        <FrequentlyQuestion questionData={questionData} />
        <BannerFooter dataFooter={dataFooter} />
      </Layout>
    </div>
  )
}

export default BusTicket
