import React from 'react'

//component
import Slider from '../slider/Slider'
import IconBar from '../iconBar/IconBar'
import Banner from '../banner/Banner'
import Section from '../shared/section/Section'
import FrequentlyQuestion from '../shared/frequently-question/FrequentlyQuestion'
import BannerFooter from '../shared/banner-footer/BannerFooter'
import Layout from '../shared/Layout'

//image
import medicalSlider from './../../assets/img/medical-service-slider.jpg'
import imedicalSection from './../../assets/img/medical-section.jpg'
import card1 from './../../assets/img/medical-service-card-1.png'
import card2 from './../../assets/img/medical-service-card-2.png'
import card3 from './../../assets/img/medical-service-card-3.png'
import medicalRequest1 from '../../assets/img/medical-request-1.jpg'
import medicalRequest2 from '../../assets/img/medical-request-2.jpg'
import medicalRequest3 from '../../assets/img/medical-request-3.jpg'
import medicalFooter from '../../assets/img/medical-footer.jpg'
import doctor from '../../assets/img/doctor.svg'

//video
import medicalVideo from './../../assets/video/medical-service.mp4'

const MedicalServices = () => {
  const dataSlider = {
    img: medicalSlider,
    title: 'مشاوره آنلاین پزشکی با اسنپ!',
    text:
      'سوپر اپلیکیشن اسنپ امکان استفاده از خدمات مشاوره آنلاین پزشکی با بهترین پزشکان متخصص و معتبر را فراهم ساخته است. شما می‌توانید با اسنپ در هرجای دنیا با پزشک خود در ارتباط باشید و به صورت آنلاین مشاوره بگیرید.',
    buttonText: 'مشاوره آنلاین پزشکی',
    showInput: false,
    color: '#58c0f9',
  }

  const dataBanner = {
    img: imedicalSection,
    title: 'مزایای مشاوره پزشکی آنلاین در اسنپ',
    text:
      'اسنپ با ارائه راهکارهای اساسی به دنبال ساده‌سازی و سرعت بخشیدن به جریان عادی زندگی مردم است. سرویس پزشک و مشاور آنلاین نیز در جهت ساده سازی فرآیند گفتگو و مطرح کردن مشکلات پزشکی، راه‌اندازی شده است.',
    cards: [
      {
        id: 1,
        imgCard: card1,
        titleCard: 'مشاوره با بهترین متخصصین',
        textCard:
          'از بهترین پزشکان متخصص و روانشناسان معتبر، مشاوره اینترنتی دریافت کنید.',
      },
      {
        id: 2,
        imgCard: card2,
        titleCard: 'کاملاً خصوصی و محرمانه',
        textCard:
          'مشاوره در بستری کاملاً محرمانه و با رعایت حفظ حریم خصوصی شما آغاز می‌شود.',
      },
      {
        id: 3,
        imgCard: card3,
        titleCard: 'مشاوره در هر زمان و هر مکان',
        textCard:
          'به صورت 24 ساعته و 7 روز هفته امکان گفتگو و صحبت با پزشکان و روانشناسان فراهم است.',
      },
    ],
  }

  const dataSection = {
    requestData: [
      {
        number: 0,
        id: 'request-1',
        img: medicalRequest1,
        title: 'دریافت مشاوره آنلاین پزشکی',
        name: 'مشاوره',
        text:
          'فقط کافی است تا از طریق سوپر اپلیکیشن اسنپ به بخش پزشک و مشاور وارد شوید و اکنون به صورت ناشناس و کاملا امن از بین تخصص‌های مختلف پزشکی و روانشناسی به صورت متنی و تلفنی، مشاوره دریافت کنید.',
      },
      {
        number: 1,
        id: 'request-2',
        img: medicalRequest2,
        title: 'دریافت نسخه پزشک',
        name: 'نسخه',
        text:
          'هیچ محدودیتی در پروسه درمان نخواهید داشت و حتی اگر نیاز به نسخه پزشک و تهیه دارو باشد این کار به صورت کاملا آنلاین طی خواهد شد و یک نسخه پزشکی معتبر دریافت خواهید کرد. امکان تهیه داروها نیز از طریق اسنپ در دسترس است.',
      },
      {
        number: 2,
        id: 'request-3',
        img: medicalRequest3,
        title: 'آزمایش در منزل',
        name: 'آزمایش',
        text:
          'ریسک بیرون رفتن از منزل می‌توانند برای برخی افراد با سابقه بیماری، استرس‌زا باشد. اگر نیاز به خدمات پزشکی مانند آزمایش، پرستاری و تزریقات، دکتر متخصص و غیره است فقط کافی است درخواست خود را در اسنپ ثبت کنید.',
      },
    ],
    dataCard: [
      {
        id: 1,
        title: 'مشاوره آنلاین با بهترین پزشکان',
        text:
          'دریافت مشاوره از یک پزشک مجرب و کارکشته سلامت شما را تضمین می‌کند. خدمات پزشکی اسنپ در همه حوزه‌های تخصصی مانند پوست و مو، زنان و زایمان و ارتوپد نیاز مشاوره‌ شما را برطرف می‌نماید. در دوران قرنطینه، دریافت مشاوره آنلاین از پزشک متخصص این حوزه نیز به پیشگیری از ابتلا به ویروس کرونا کمک می‌کند.',
      },
      { id: 2, type: 'video', source: medicalVideo },
      {
        id: 3,
        title: 'مشاوره آنلاین با بهترین روانشناسان',
        text:
          'جامعه ما بیش از هر زمان دیگری به مشاوره روانشناسی نیاز دارد زیرا مردم نسبت به گذشته از ناهنجاری‌های مختلف رنج می‌برند. این مشکلات می‌توانند به تحصیل، ازدواج، اعتیاد، مسائل مربوط به بلوغ و غیره مربوط باشند. از سویی دیگر، انتخاب روانشناس مجرب جهت ارائه گفتگو محرمانه امری ضروری است. روانشناسان سرویس پزشکی اسنپ با داشتن سابقه‌ درخشان برای کمک به شما در دسترس هستند.',
      },
      {
        id: 4,
        title: 'دریافت مشاوره معتبر و تخصصی',
        text:
          'با شیوع بیماری‌های مختلفی که در این روزها نام آنها را می‌شنویم، ممکن است با ظاهر شدن کوچکترین علائم فیزیکی یا روحی و روانی با خود بگوییم، آیا من بیمار شده‌ام؟ نگران نباشید و بدون اینکه خود درمانی یا راه‌حل غیر منطقی را پیش ببرید فقط کافی است با پزشکان اسنپ به صورت آنلاین موضوع را مطرح کنید.',
      },
    ],
    color: '#58c0f9',
  }

  const questionData = [
    {
      id: 0,
      active: false,
      title: 'برای درخواست مشاوره آنلاین چه کار کنم؟',
      answer:
        'برای دریافت مشاوره از پزشکان و روانشناسان باید سوپر اپلیکیشن اسنپ را روی گوشی خود نصب کنید. همچنین، از طریق وب‌سایت اسنپ دکتر نیز می‌توانید از خدمات مشاوره‌ای استفاده کنید.',
    },
    {
      id: 1,
      active: false,
      title: 'برای درخواست مشاوره آنلاین، من با چه پزشکی صحبت می‌کنم؟',
      answer:
        'بعد از انتخاب نوع حوزه درمانی، فهرستی از پزشکان در اختیار شما قرار می‌گیرد که  می‌توانید شماره نظام پزشکی، مقدار سابقه، دانشگاه محل تحصیل و غیره را در پروفایل آن‌ها مشاهده کنید. اکنون می‌توانید دکتر مورد نظر خود را انتخاب کنید.',
    },
    {
      id: 2,
      active: false,
      title: 'نمی‌دانم برای مشاوره با چه پزشک یا روانشناسی صحبت کنم؟',
      answer:
        'در صورتی که در انتخاب مشاور خود تردید دارید، می‌توانید توضیحات پروفایل پزشکان و مشاوران اسنپ دکتر را مطالعه کنید. نظرات دیگر کاربران می‌تواند به شما در انتخاب مشاور مناسب کمک کند.',
    },
    {
      id: 3,
      active: false,
      title: 'پس از درخواست مشاوره چقدر زمان می‌برد تا به پزشک متصل شوم؟',
      answer:
        'پس از ارسال درخواست مشاوره، در سریع‌ترین زمان به پزشک مورد نظر متصل می‌شوید  و پرسش‌های خود را با او در میان می‌گذارید.',
    },
    {
      id: 4,
      active: false,
      title: 'اگر پزشک جواب ندهد، چه کنم؟',
      answer:
        'برای رفع هرگونه مشکل لطفاً با پشتیبانی اسنپ دکتر با شماره 49187654-021 تماس بگیرید.',
    },
    {
      id: 5,
      active: false,
      title: 'سؤال خود را به چه صورتی می‌توانم ارسال کنم؟',
      answer:
        '‌شما می‌توانید به صورت متنی، تصویری و صوتی با پزشک یا روانشناس صحبت کنید.',
    },
    {
      id: 6,
      active: false,
      title: 'آیا می‌توانم عکس آزمایش یا تصویر نسخه را به پزشک ارسال کنم؟',
      answer:
        'بله، شما می‌توانید عکس آزمایش‌های مختلف خود را به همراه نسخه جهت کسب اطلاعات لازم به مشاور ارسال کنید.',
    },
    {
      id: 7,
      active: false,
      title: 'آیا دفترچه بیمه تأمین اجتماعی قابل قبول است؟',
      answer:
        'برای مشاوره تلفنی فقط بیمۀ سامان مورد تائید است که با وارد کردن کد ملی خود می‌توانید مشاوره با بیمه را دریافت کنید',
    },
    {
      id: 8,
      active: false,
      title: 'من ایران نیستم، آیا می‌توانم از خدمات اسنپ دکتر استفاده کنم؟',
      answer:
        'بله، با شماره تلفن خارج از کشور خود ثبت نام کنید و به صورت ارزی مبلغ را پرداخت کنید. در صورت هرگونه مشکل با شماره واتس آپ پشتیبانی 09016417863 تماس بگیرید.',
    },
    {
      id: 9,
      active: false,
      title: 'هزینه دریافت مشاوره چقدر است؟',
      answer:
        'هزینه بستگی به مدرک تحصیلی مشاوران دارد. کارشناسی ارشد روانشناسی ۲۲ هزار تومان، دکترای روانشناسی 24 هزار تومان و دکتری پزشکی 27.500 هزار تومان برای هر 10 دقیقه دریافت می‌کنند.',
    },
  ]

  const dataFooter = {
    img: medicalFooter,
    icon: doctor,
    title: 'خدمات پزشک و مشاوره آنلاین اسنپ',
    text:
      'هم‌اکنون خدمات پزشکی اسنپ، از طریق سیستم‌عامل‌های مختلف موبایل و وب اپلیکیشن به راحتی در دسترس شماست. با صرف کمترین هزینه و در کوتاه‌ترین زمان، بهترین مشاوره با پزشکان و متخصصان را تجربه کنید.',
    button: 'مشاوره آنلاین پزشکی',
  }

  return (
    <div>
      <Layout id='0'>
        <Slider dataSlider={dataSlider} />
        <IconBar />
        <Banner dataBanner={dataBanner} />
        <Section dataSection={dataSection} />
        <FrequentlyQuestion questionData={questionData} />
        <BannerFooter dataFooter={dataFooter} />
      </Layout>
    </div>
  )
}

export default MedicalServices
