import React from 'react'

//component
import Slider from '../slider/Slider'
import IconBar from '../iconBar/IconBar'
import Banner from '../banner/Banner'
import Section from '../shared/section/Section'
import FrequentlyQuestion from '../shared/frequently-question/FrequentlyQuestion'
import BannerFooter from '../shared/banner-footer/BannerFooter'
import Layout from '../shared/Layout'

//image
import snappCreditSlider from './../../assets/img/snapp-credit-slider.jpg'
import snappCreditSection from './../../assets/img/snapp-credit-section.jpg'
import card1 from './../../assets/img/credit-card-1.png'
import card2 from './../../assets/img/credit-card-2.png'
import card3 from './../../assets/img/credit-card-3.png'
import creditRequest1 from '../../assets/img/credit-request-1.jpg'
import creditRequest2 from '../../assets/img/credit-request-2.jpg'
import creditRequest3 from '../../assets/img/credit-request-3.jpg'
import creditFooter from '../../assets/img/credit-footer.jpg'
import credit from '../../assets/img/pay.svg'
import credittImg from '../../assets/img/credit-img.jpg'

const SnappCredit = () => {
  const dataSlider = {
    img: snappCreditSlider,
    title: 'الان بخر، بعد پرداخت کن',
    text:
      'سوپر اپلیکیشن اسنپ سرویس اعتباری خود را با مدل «الان بخر، بعدا پرداخت کن» راه‌اندازی کرده است. با استفاده از این روش پرداخت، کاربران می‌توانند محصولات و خدمات مورد نیاز خود را در لحظه تهیه یا دریافت کنند و مبلغ آن را در پایان ماه بپردازند.',
    buttonText: 'ورود به سرویس اعتباری',
    showInput: false,
    color: '#028ef9',
  }

  const dataBanner = {
    img: snappCreditSection,
    title: 'مزایای سرویس اعتباری اسنپ!',
    text:
      'سرویس اعتباری راهکاری موثر برای مدیریت نقدینگی است، به این صورت که می‌توان هزینه‌ها را اولویت‌بندی کرد و موجودی نقد را برای پرداخت‌های با اهمیت بالاتر یا مواردی که امکان پرداخت اعتباری ندارند، اختصاص داد و نقدینگی را تا آخر ماه ذخیره کرد.',
    cards: [
      {
        id: 1,
        imgCard: card1,
        titleCard: 'پرداخت هزینه در آینده ',
        textCard:
          'با فعال‌سازی سرویس اعتباری اسنپ، بدون دغدغه پرداخت آنی، می‌توان برای پرداخت هزینه سفر، سفارش غذا، خرید کالا و سایر خدمات از اعتبار استفاده کرد و هزینه مصرفی را در پایان ماه یا به صورت اقساطی بسته به نوع خرید پرداخت کرد',
      },
      {
        id: 2,
        imgCard: card2,
        titleCard: 'عدم نیاز به ضامن و دریافت کارمزد',
        textCard:
          'از ویژگی‌های مهم سرویس اعتباری اسنپ می‌توان عدم نیاز به ارائه‌ وثیقه، ضامن و همچنین کارمزد اشاره کرد.',
      },
      {
        id: 3,
        imgCard: card3,
        titleCard: 'فعال سازی سرویس',
        textCard:
          'فعال‌سازی سرویس اعتباری در لحظه و بدون اخذ هیچ‌گونه مدرک و سابقه انجام می‌شود و اعتبار تخصیص داده شده بلافاصله قابل استفاده است. ',
      },
    ],
  }

  const dataSection = {
    requestData: [
      {
        number: 0,
        id: 'request-1',
        img: creditRequest1,
        title: 'نحوه فعال سازی سرویس اعتباری',
        name: 'فعال سازی',
        text:
          'سرویس اعتباری تنها برای کاربران منتخب که واجد شرایط هستند فعال می‌شود. برای فعال‌سازی این قابلیت، در صفحه اصلی سوپر اپلیکیشن بر روی آیکون «سرویس اعتباری» کلیک کنید و سپس با وارد کردن شماره ملی  خود، به صورت رایگان در این سرویس ثبت‌نام کنید. در صورتی که واجد شرایط باشید، سرویس اعتباری برای شما فعال خواهد شد.',
      },
      {
        number: 1,
        id: 'request-2',
        img: creditRequest2,
        title: 'نحوه استفاده از ‏سرویس اعتباری',
        name: 'استفاده از خدمات',
        text:
          'بعد از فعال‌سازی، اعتبار با مقدار مشخص در پنل کاربری افراد ثبت می‌شود. سپس، کاربران با داشتن موجود حساب می‌توانند از خدمات و سرویس‌های مختلف سوپراپ اسنپ استفاده کنند.',
      },
      {
        number: 2,
        id: 'request-3',
        img: creditRequest3,
        title: 'تسویه صورت حساب اعتباری',
        name: 'تسویه حساب',
        text:
          'برای تسویه‌حساب، از صفحه اصلی سوپر اپلیکیشن روی آیکون «سرویس اعتباری» کلیک کنید و بعد از دیدن صورت‌حساب خود، دکمه پرداخت را بزنید. مهلت تسویه‌حساب پایان هر ماه است.',
      },
    ],
    dataCard: [
      {
        id: 1,
        title: 'جدیدترین شیوه پرداخت با سرویس اعتباری',
        text:
          'سرویس الان بخر، بعد پرداخت کن (Buy Now, Pay Later) که به اختصار(BNPL) نامیده می‌شود، یکی از جدیدترین شیوه‌های پرداخت در دنیاست که محبوبیت زیادی دارد. با استفاده از این روش پرداخت، کاربران می‌توانند محصولات و خدمات مورد نیاز خود را به صورت آنی دریافت کنند. سپس می‌توانند در پایان ماه یا به صورت اقساطی طی چند ماه مبلغ آن را پرداخت نمایند.',
      },
      { id: 2, type: 'img', source: credittImg },
      {
        id: 3,
        title: 'سریع‌ترین، امن‌ترین و راحت‌ترین شیوه‌ی پرداخت',
        text:
          'یکی از مزیت‌های استفاده از سرویس اعتباری، عدم نیاز به اتصال به اینترنت هنگام پرداخت است. از طرفی دغدغه دریافت رمز دوم  یا مشکل در اتصال به درگاه بانک برای پرداخت آنلاین نیز وجود ندارد و کاربر می‌تواند به راحتی پرداخت خود را انجام دهد.',
      },
      {
        id: 4,
        title: 'جایگزینی عالی برای کارت‌های اعتباری',
        text:
          'از این جهت که ایرانیان برخلاف اکثر مردم دنیا به کارت‌های اعتباری متداول دسترسی ندارند، سرویس اعتباری به عنوان راهکاری موثر برای پر کردن این خلا شناخته می‌شود. به همین دلیل، سرویس اعتباری اسنپ اولین سرویس اعتباردهی بر پایه مدل (BNPL) در ایران است.',
      },
    ],
    color: '#028ef9',
  }

  const questionData = [
    {
      id: 0,
      active: false,
      title: 'سرویس اعتباری چیست؟',
      answer:
        'سرویس اعتباری، راهی سریع و آسان برای پرداخت هزینه‌ها بدون داشتن موجودی است. با فعال‌ ‏کردن این سرویس، اعتبار مشخصی تا پایان همان ماه به شما تعلق می‌گیرد و می‌توانید از اعتبار ‏خود برای پرداخت هزینه سفر، سفارش غذا، سفارش از سوپر مارکت و درخواست خدمات اسنپ ‏دکتر بدون داشتن موجودی استفاده کنید. توجه داشته باشید که از تاریخ استفاده تا پایان هر ماه ‏فرصت دارید تا صورت‌حساب خود را تسویه کنید‎',
    },
    {
      id: 1,
      active: false,
      title: 'چگونه می‌توانم سرویس اعتباری خود را فعال کنم؟',
      answer:
        'سرویس اعتباری تنها برای کاربران منتخب که واجد شرایط هستند فعال میشود. برای فعالسازی این قابلیت، در صفحه اصلی سوپر اپلیکیشن بر روی آیکون «سرویس اعتباری» کلیک کنید و سپس با وارد کردن شماره ملی  خود، به صورت رایگان در این سرویس ثبت‌نام کنید. در صورتی که واجد شرایط باشید، سرویس اعتباری برای شما فعال خواهد شد.',
    },
    {
      id: 2,
      active: false,
      title: 'چگونه می‌توانم سرویس اعتباری‌ام را غیرفعال کنم؟',
      answer:
        'در حال حاضر، امکان غیر فعال‌سازی سرویس اعتباری در اپلیکیشن وجود ندارد ولی اگر از سرویس ‏اعتباری برای پرداخت ‏هزینه‌هایتان خود استفاده نکنید برای شما صورت‌حسابی صادر نمی‌شود‏',
    },
    {
      id: 3,
      active: false,
      title:
        'اگر تا پایان دوره نتوانم از تمام موجودی سرویس اعتباری خود استفاده کنم، باقی مانده آن چه ‏می‌شود؟‎‎',
      answer:
        'تا پایان دوره تعیین شده فرصت دارید از موجودی سرویس اعتباری خود استفاده کنید. توجه داشته ‏باشید، با تمام شدن دوره، ‏موجودی باقی مانده قابل انتقال به ماه بعد نخواهد بود‎‏',
    },
    {
      id: 4,
      active: false,
      title:
        'اگر هزینه‌های مربوط به اسنپ از موجودی سرویس اعتباری‌ام بیشتر بود چکار کنم؟',
      answer:
        'در این صورت نمی‌توانید از سرویس اعتباری برای پرداخت هزینه‌هایتان استفاده کنید ولی می‌توانید ‏روش پرداخت دیگری را ‏انتخاب کنید‎‏',
    },
    {
      id: 5,
      active: false,
      title: 'اگر صورت‌حسابم را در موعد مقرر پرداخت نکنم چه اتفاقی میفتد؟',
      answer:
        'در صورت عدم پرداخت صورتحساب در موعد مقرر، علاوه بر اینکه دیگر نمیتوانید از سرویس اعتباریتان استفاده کنید، مبلغی معادل پنج درصد از بدهی پرداخت نشده به عنوان جریمه تاخیر محاسبه و به مبلغ صورتحساب شما اضافه میشود و به ازای هر ماه دیرکرد مبلغ جریمه دیگری دوباره محاسبه و به جریمه ماه قبل اضافه میشود. با گذشت زمان، در صورت عدم پرداخت بدهی، اطلاعات شما به عنوان مشتری بدحساب به نهادهای نظارتی و اعتبارسنجی ارائه میشود.',
    },
  ]

  const dataFooter = {
    img: creditFooter,
    icon: credit,
    title: 'سرویس اعتباری اسنپ',
    text:
      'امکان بهره‌مندی از سرویس اعتباری اسنپ، از طریق سیستم‌عامل‌های مختلف موبایل و وب اپلیکیشن به راحتی در دسترس شماست. سریع‌ترین، امن‌ترین و راحت‌ترین شیوه‌ی پرداخت با اسنپ!',
    button: 'ورود به سرویس اعتباری',
  }

  return (
    <div>
      <Layout id='0'>
        <Slider dataSlider={dataSlider} />
        <IconBar />
        <Banner dataBanner={dataBanner} />
        <Section dataSection={dataSection} />
        <FrequentlyQuestion questionData={questionData} />
        <BannerFooter dataFooter={dataFooter} />
      </Layout>
    </div>
  )
}

export default SnappCredit
