import React, { useState } from 'react'

//component
import Layout from '../shared/Layout'

//style
import styles from './Contact.module.css'

//image
import searchIcon from '../../assets/img/search.svg'

const Contact = () => {
  const citiesData = [
    {
      id: 0,
      name: 'دفتر مرکزی',
      address:
        'آدرس: خیابان آفریقا، خیابان شهید عاطفی غربی، خیابان مهرداد، پلاک ۱، طبقه ۴ جنوبی',
      houres: '',
    },
    {
      id: 1,
      name: 'دفتر امور کاربران راننده و مسافر در تهران',
      address:
        'آدرس:  (دفتر تکمیل مدارک) خیابان سازمان آب نرسیده به آیت اله کاشانی پلاک ۲۶۵',
      houres: 'ساعت کاری: شنبه تا چهارشنبه ساعت ۸ تا ۱۷ /  پنجشنبه‌ها تعطیل',
    },
    {
      id: 2,
      name: 'ارومیه',
      address:
        'آدرس: بلوار ورزش، جنب مجتمع بهزیستی، پلاک 22، ساختمان آوا، طبقه دوم واحد 4',
      houres: ' ساعات کاری: شنبه تا چهارشنبه ۸:۳۰ تا ۱۷',
    },
    {
      id: 3,
      name: 'اراک',
      address:
        'آدرس: خیابان قدوسی، جنب کوچه سلطانی، ساختمان دماوند، پلاک ۲۴، طبقه اول، واحد ۱ ',
      houres: ' ساعت کاری : شنبه تا چهارشنبه ۸:۳۰ تا ۱۷:۳۰ ',
    },
    {
      id: 4,
      name: 'اردبیل',
      address:
        'آدرس: اردبیل،‌ ما بین ایستگاه سرعین و چهار راه حافظ روبروی خیابان هفده شهریور نبش کوچه سما ساختمان لاکچری طبقه یک واحد یک ',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 5,
      name: 'اصفهان',
      address:
        'آدرس: اصفهان، خیابان چهارباغ بالا، کوچه حضرت یحیی، نبش کوچه باغ زرشک، پلاک 58',
      houres: 'ساعت کاری: شنبه تا چهارشنبه از ساعت ۹:۰۰ تا ۱۷:۰۰',
    },
    {
      id: 6,
      name: 'آمل',
      address:
        'آدرس: میدان قائم، کوچه آموزش و پرورش، روبروی آموزش و پرورش، مجتمع الماس، واحد ۴۰۱',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 7,
      name: 'اهواز',
      address:
        'آدرس: کیانپارس، فلکه اول، نبش موحدین شرقی، برج کوثر، طبقه اول (درب روبروي فضاي سبز)',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۸:۰۰',
    },
    {
      id: 8,
      name: 'ایلام',
      address:
        'آدرس: ایلام- میدان میلاد - ابتدای بلوار دانشجو - مجتمع شنتیا طبقه دوم - طبقه بالای بیمه ایران - واحد ۲',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 9,
      name: 'بابل، قائمشهر',
      address:
        'آدرس: بابل، چهارراه شهربانی، خیابان بسطامی، نیایش ۱۰،ساختمان مازیار، واحد ۱',
      houres: ' ساعات کاری:‌ شنبه تا چهارشنبه ۸:۳۰ تا ۱۸:۰۰',
    },
    {
      id: 10,
      name: 'بابلسر',
      address:
        'آدرس: انتهای بلوار پاسداران به سمت فریدونکنار، میدان معلم، پاساژ بزرگمهر، طبقه همکف، واحد ۵۸',
      houres: ' ساعات کاری:‌ شنبه تا چهارشنبه ۸:۳۰ تا ۱۸:۰۰',
    },
    {
      id: 11,
      name: 'بجنورد',
      address:
        'آدرس: خیابان امام خمینی، خیابان شهید معصوم زاده، مجتمع اوج (سینما عمیق)، طبقه چهارم، واحد ۴۰۵',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 12,
      name: 'بندرعباس',
      address:
        'آدرس: خیابان شریعتی شمالی ( حد فاصل چهارراه فاطمیه به سمت میدان شاه حسینی ) - کوچه جاودان  11 - جنب زمین ورزشی ساختمان مهر - طبقه اول - واحد ۳',
      houres: ' ساعات کاری: شنبه تا چهارشنبه  ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 13,
      name: 'بوشهر',
      address:
        'آدرس: خیابان طالقانی (صلح آباد) - نرسیده به سه راه گمرک- نبش کوچه هامور ۷۰- ساختمان ولیعصر طبقه اول',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 14,
      name: 'بیرجند',
      address:
        'آدرس: ضلع شرقی بلوار صیاد شیرازی، واحد ۱۳، ساختمان روشنایی کوشافر، طبقه اول',
      houres: 'ساعات کاری: ساعت کار حضوری فقط سه شنبه ۱۰ تا ۱۲',
    },
    {
      id: 15,
      name: 'تبریز و سهند',
      address:
        'آدرس: تبریز، خیابان چایکنار (به سمت چهارراه آبرسان)، بعد از پل سنگی نرسیده به خیابان رضانژاد، کوی دمشقیه، جنب وین مارکت',
      houres: ' ساعت کاری: شنبه تا چهارشنبه از ساعت ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 16,
      name: 'تهران، پردیس، بومهن، رودهن و لواسانات',
      address:
        'آدرس: (دفتر آموزش و دفتر پشتیبانی) خیابان سازمان آب نرسیده به آیت اله کاشانی پلاک ۲۶۵',
      houres: 'ساعت کاری: شنبه تا چهارشنبه ساعت ۸ تا ۱۷ /  پنجشنبه‌ها تعطیل',
    },
    {
      id: 17,
      name: 'خرم آباد',
      address: 'آدرس: خیابان مطهری، بعد از سرچشمه، مجتمع پارسا، طبقه اول',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۸:۰۰',
    },
    {
      id: 18,
      name: 'رشت، آستانه اشرفیه، کوچصفهان، لنگرود، خمام ',
      address:
        'آدرس: رشت، خیابان امام، بانک ملی به سمت بیمارستان امیرالمومنین، کوچه ۴۰ تن، ساختمان پارسا، پلاک ۵۳، طبقه اول، واحد ۱',
      houres: 'ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷',
    },
    {
      id: 19,
      name: 'زاهدان',
      address:
        'آدرس: خیابان امیرالمومنین، نبش امیرالمومنین ۷، ساختمان قانون، طبقه اول، واحد ۱۰۱',
      houres: 'ساعات کاری: ساعت کار حضوری فقط سه شنبه ۱۰ تا ۱۲',
    },
    {
      id: 20,
      name: 'زنجان',
      address: 'آدرس: گلشهر فاز یک - امانی ۵ ساختمان ۱۶۲۶ - طبقه سوم - واحد ۵',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۸:۰۰',
    },
    {
      id: 21,
      name: 'ساری',
      address:
        'آدرس: میدان فرح آباد، ابتدای بلوار فرح آباد، جنب قنادی پاسارگاد، ساختمان اردشیر، طبقه اول',
      houres: ' ساعات کاری:‌ شنبه تا چهارشنبه ۸:۳۰ تا ۱۸:۰۰',
    },
    {
      id: 22,
      name: 'سمنان',
      address:
        'آدرس: سمنان بلوار شهید نوروزی مجتمع پزشکان بوعلی طبقه دهم واحد ۱۰۰۵',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷:۰۰',
    },
    {
      id: 23,
      name: 'شاهرود',
      address:
        'آدرس: خیابان فردوسی، خیابان حجاب، میدان حجاب، ساختمان حجاب، طبقه اول، واحد ۶',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷:۰۰',
    },
    {
      id: 24,
      name: 'شهرکرد',
      address:
        'آدرس: چهار راه دروازه فارسان، تقاطع خیابان فردوسی و خیابان خواجه نصیر، پاساژ اداری خدماتی لاله، طبقه دوم، واحد ۵',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 25,
      name: 'شیراز و مرودشت',
      address:
        'آدرس: شیراز، خیابان عفیف آباد، مجتمع اداری و تجاری حافظ، طبقه چهارم واحد ۱۳',
      houres: ' ساعت کاری: شنبه تا چهارشنبه ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 26,
      name: 'قزوین',
      address:
        'آدرس: قزوین- غیاث آباد -بلوار آزادگان -نبش کوچه 5 (شهید ذوالقدر ) ساختمان پاسارگاد طبقه 2',
      houres: ' ساعات کاری: شنبه تا چهارشنبه ۸:۳۰ تا ۱۸ ',
    },
    {
      id: 27,
      name: 'قم',
      address: 'آدرس: بلوار عطاران، بلوار مفتح غربی، نبش کوچه ۲۰، طبقه ۳',
      houres: ' ساعت کاری : شنبه تا چهارشنبه ۸:۳۰ تا ۱۶:۳۰',
    },
    {
      id: 28,
      name: 'کاشان',
      address:
        'آدرس: بلوار امام رضا، حد فاصل کاشان مال و میدان کتاب، روبروی بریدگی، طبقه  فوقانی فروشگاه تن ایران',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 29,
      name: 'کرج، هشتگرد و نظرآباد',
      address:
        'آدرس: کرج، عظیمیه - بلوار استقلال -ابتدای بلوار ۴۵متری کاج - کنارگذر پل شهدای غواص - پلاک ۱۳ - طبقه اول',
      houres: ' ساعت کاری: شنبه تا چهارشنبه ساعت ۸:۳۰ تا ۱۷',
    },
    {
      id: 30,
      name: 'کردستان',
      address:
        'آدرس: خیابان آبیدر (صفری)، جنب بانک کشاورزی، ساختمان بیمه ما، طبقه دوم',
      houres: ' ساعت کاری: شنبه تا چهارشنبه: ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 31,
      name: 'کرمان ',
      address:
        'آدرس: کرمان - خیابان هزارویکشب، نبش کوچه ۱۵، ساختمان بانک سپه، طبقه ۲',
      houres: 'ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ الی ۱۷',
    },
    {
      id: 32,
      name: 'کرمانشاه',
      address: 'آدرس: میدان فردوسی، مجتمع اداری فردوسی، طبقه دوم',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷:۳۰',
    },
    {
      id: 33,
      name: 'کیش',
      address: 'آدرس: کیش خیابان فردوسی روبروی بانک آینده',
      houres: '',
    },
    {
      id: 34,
      name: 'گرگان',
      address:
        'آدرس: گرگان، بلوار ناهارخوران، مابین عدالت ۵۴ و ۵۶، مجتمع اداری تجاری میلاد نور، طبقه دوم، واحد ۲',
      houres: 'شنبه تا چهارشنبه ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 35,
      name: 'لاهیجان',
      address:
        'آدرس: خیابان شهید بهشتی (شیشه گران)، بهشتی ۵، ساختمان نظام، طبقه ۵',
      houres: 'ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷',
    },
    {
      id: 36,
      name: 'مشهد، گلبهار و چناران',
      address:
        'آدرس: بزرگراه کلانتری، ابتدای کلانتری ۴ (انوری)، پلاک ۳۱۸، طبقه ۱',
      houres: 'ساعات کاری: ساعت کار حضوری فقط سه شنبه ۱۰ تا ۱۲',
    },
    {
      id: 37,
      name: 'همدان',
      address:
        'آدرس: خیابان طالقانی مابین چهارراه حبیبی و چهارراه فرهنگ روبروی بانک صادرات جنب مرکز خرید ایران زمین ساختمان عقیق طبقه اول واحد ۱',
      houres: ' ساعت کاری : شنبه تا چهارشنبه ۸:۳۰ تا ۱۷:۳۰',
    },
    {
      id: 38,
      name: 'یاسوج',
      address:
        'آدرس: بلوار ابوذر، بین ابوذر ۷ و ۶، جنب دکوراسیون کاخ، ساختمان امام رضا طبقه سوم',
      houres: ' ساعات کاری: شنبه الی چهارشنبه ۸:۳۰ تا ۱۷:۴۵',
    },
    {
      id: 39,
      name: 'یزد',
      address: 'آدرس: بلوار جوان، روبروی بریدگی، مجتمع جوان، واحد ۳',
      houres: 'ساعت کاری: شنبه تا چهارشنبه ساعت ۸:۳۰ تا ۱۷:۴۵',
    },
  ]

  const [search, setSearch] = useState('')

  const match = citiesData.filter((city) => city.name.includes(search))

  const searchHandler = (event) => {
    setSearch(event.target.value)
  }

  return (
    <div>
      <Layout id="7">
        <div className={styles.contactContainer}>
          <div className={styles.citiesContainer}>
            <div className={styles.inputGroup}>
              <img src={searchIcon} alt="search" />
              <input
                value={search}
                onChange={searchHandler}
                placeholder="جست و جوی نام شهر"
              />
            </div>
            {match.map((city) => (
              <div className={styles.cityCard}>
                <h4>{city.name}</h4>
                <p>{city.address}</p>
                <p>{city.houres}</p>
              </div>
            ))}
          </div>
          <div className={styles.infoContainer}>
            <div>
              <h4>تماس با ما</h4>
              <p>تلفن پشتیبانی: ۴۱۸۴۹۰۰۰ – ۰۲۱</p>
              <p>فکس: ۸۸ ۴۷ ۷۷ ۸۹ – ۰۲۱</p>
              <p>پست الکترونیکی: info@snapp.cab</p>
            </div>
            <div>
              <h4>دفتر امور کاربران راننده و مسافر</h4>
              <p>شماره تماس: ۴۱۸۴۹۰۰۰ – ۰۲۱</p>
              <p>خدمات مربوط به مسافران به صورت غیر حضوری عرضه می‌شود.</p>
            </div>
            <div>
              <h4>دفتر اسنپ‌باکس و اسنپ‌بایک در تهران</h4>
              <p>خیابان سازمان آب نرسیده به آیت اله کاشانی پلاک ۲۶۵</p>
              <p>تلفن پشتیبانی: ۹۶۶۴۲ – ۰۲۱</p>
            </div>
          </div>
        </div>
      </Layout>
    </div>
  )
}

export default Contact
