import React from 'react'

//component
import Slider from '../slider/Slider'
import IconBar from '../iconBar/IconBar'
import Banner from '../banner/Banner'
import Section from '../shared/section/Section'
import FrequentlyQuestion from '../shared/frequently-question/FrequentlyQuestion'
import BannerFooter from '../shared/banner-footer/BannerFooter'
import DataSection from '../shared/data-section/DataSection'
import Layout from '../shared/Layout'

//image
import clubSlider from './../../assets/img/club-slider.jpg'
import clubSection from './../../assets/img/club-section.jpg'
import card1 from './../../assets/img/club-card-1.png'
import card2 from './../../assets/img/club-card-2.png'
import card3 from './../../assets/img/club-card-3.png'
import clubRequest1 from '../../assets/img/club-request-1.jpg'
import clubRequest2 from '../../assets/img/club-request-2.jpg'
import clubRequest3 from '../../assets/img/club-request-3.jpg'
import clubFooter from '../../assets/img/club-footer.jpg'
import club from '../../assets/img/club.svg'

//video
import clubVideo from '../../assets/video/club.mp4'

const Club = () => {
  const dataSlider = {
    img: clubSlider,
    title: 'اسنپ‌ کلاب؛ باشگاه مشتریان اسنپ!',
    text:
      'باشگاه مشتریان اسنپ که «اسنپ‌کلاب» نام دارد، با ارائه جوایز مختلف و شگفت‌انگیز از همراهی کاربران عزیز خود قدردانی می‌کند. با هر بار استفاده از سرویس‌های مختلف اسنپ امتیاز دریافت کنید و این امتیازها برای شما تخفیف‌های ویژه‌ای به همراه دارد.',
    buttonText: 'ورود به اسنپ کلاب',
    showInput: false,
    color: '#ffce00',
  }

  const dataBanner = {
    img: clubSection,
    title: 'مزایای بی‌نظیر اسنپ ‌کلاب',
    text:
      'اسنپ‌کلاب با ارائه راهکارهای متنوع به دنبال جلب رضایت حداکثری مشتریان و کاربران وفادار اسنپ است.',
    cards: [
      {
        id: 1,
        imgCard: card1,
        titleCard: 'دریافت امتیاز در هر بار تراکنش',
        textCard:
          'با استفاده از خدمات اسنپ در ازای تراکنش موفق، امتیاز دریافت می‌کنید. با جمع کردن این امتیازها، جوایز فوق‌العاده‌ای به شما ‏ارائه می‌شوند.‏',
      },
      {
        id: 2,
        imgCard: card2,
        titleCard: 'قرعه کشی و جوایز هیجان انگیز',
        textCard:
          'با استفاده از سرویس‌های اسنپ می‌توانید تخفیف‌های مختلف بهره‌مند شوید و شانس خود را برای برنده شدن در قرعه کشی ‏افزایش دهید.‏',
      },
      {
        id: 3,
        imgCard: card3,
        titleCard: 'پشتیبانی تمام وقت',
        textCard:
          'پشتیبانی اسنپ به صورت ۲۴ ساعته و در تمام روزهای هفته، آماده کمک و پاسخ‌دهی به تمام سوالات شما است.',
      },
    ],
  }

  const dataSection = {
    requestData: [
      {
        number: 0,
        id: 'request-1',
        img: clubRequest1,
        title: 'نحوه مشاهده امتیازها ',
        name: 'مشاهده امتیاز',
        text:
          'وارد سوپراپلیکیشن اسنپ شوید. در منوی بالا، گزینه امتیاز را مشاهده می‌کنید. گزینه امتیاز را انتخاب کنید تا وارد اسنپ‌کلاب شوید. در این قسمت می‌توانید برحسب تعداد امتیاز از تخفیف‌های هیجان انگیز استفاده کنید.',
      },
      {
        number: 1,
        id: 'request-2',
        img: clubRequest2,
        title: 'نحوه دریافت جایزه',
        name: 'دریافت جایزه',
        text:
          'بعد از وارد شدن به اسنپ‌کلاب، تخفیف‌های زیادی برای شما نمایش داده می‌شوند. دسته بندی مورد نظر خود را انتخاب کنید، سپس وارد صفحه خدمات مورد نظر می‌شوید. دکمه دریافت جایزه را مشاهده خواهید کرد. گزینه دریافت را انتخاب کنید. سپس کدتخفیف مربوطه به شما نمایش داده می‌شود. با کپی کردن کد می‌توانید از آن در خدمات مخصوص به آن کد کنید.',
      },
      {
        number: 2,
        id: 'request-3',
        img: clubRequest3,
        title: 'مشاهده تاریخچه امتیازها',
        name: 'تاریخچه امتیازها ',
        text:
          'در اسنپ‌کلاب بخشی به عنوان تاریخچه امتیازها وجود دارد. با انتخاب این بخش می‌توانید امتیازهای دریافتی خود را در هر بار تراکنش موفق از سرویس‌های اسنپ مشاهده کنید.',
      },
    ],
    dataCard: [
      {
        id: 1,
        title: 'شرکت در قرعه‌کشی‌های بزرگ اسنپ',
        text:
          'با جمع امتیاز امکان شرکت در قرعه کشی های بزرگ اسنپ وجود دارد. در قرعه کشی‌ها می‌توان شانس خود را برای برنده شدن گوشی همراه، کنسول بازی و دیگر جوایز امتحان کنید. شرکت در قرعه کشی قوانین مشخصی دارد و برای اطلاع از آن می توانید به سوپراپلیکیشن اسنپ مراجعه کنید.',
      },
      { id: 2, type: 'video', source: clubVideo },
      {
        id: 3,
        title: 'دریافت تخفیف از سرویس‌های اسنپ',
        text:
          'کاربران وفادار می‌توانند از سرویس‌های درخواست خودرو، پیک موتوری، غذا، سوپرمارکت، پرواز، پزشکی و مشاوره، وانت و هتل، تخفیف‌های ویژه دریافت کنند. می‌توان با مراجعه به بخش اسنپ ‌کلاب لیست تخفیف‌ها و جایزه‌های موجود را مشاهده کرد.',
      },
      {
        id: 4,
        title: 'امتیازهای مختلف برای هر سرویس اسنپ',
        text:
          'هر یک از خدمات اسنپ دارای یک امتیاز مشخص است. خرید اینترنت و شارژ سیم‌کارت 10 امتیاز دارد. در خدمات پرواز داخلی و هتل به ازای هر تراکنش 600 امتیاز و در پروازهای خارجی 1200 امتیاز اختصاص داده می‌شود. برای خدمات قطار به ازای تراکنش موفق 500 امتیاز و اتوبوس 100 امتیاز دارد. برای افزایش امتیاز می توانید از خدماتی که امتیاز بیشتر دارند استفاده کنید.',
      },
    ],
    color: '#ffce00',
  }

  const questionData = [
    {
      id: 0,
      active: false,
      title: 'اسنپ ‌کلاب چه خدماتی دارد؟',
      answer:
        'اسنپ‌ کلاب باشگاه وفاداری کاربران سوپراپلیکیشن اسنپ است. شما با استفاده از سرویس‌های مختلف در ازای انجام تراکنش ‏موفق، به صورت خودکار امتیاز می‌گیرید. می‌توانید با جمع کردن این امتیازها، جوایز مختلفی از اسنپ! کلاب دریافت کنید. میزان ‏امتیاز لازم برای هر جایزه کنار آن مشخص شده و با جمع‌آوری امتیاز کافی، می‌توانید آن را دریافت کنید.‏',
    },
    {
      id: 1,
      active: false,
      title: 'چطور می‌توانم در اسنپ‌ کلاب امتیاز خود را افزایش بدهم؟',
      answer:
        'در سوپراپلیکیشن اسنپ می‌توانید با استفاده از سرویس‌هایی مختلف، امتیاز خود را افزایش دهید.‏',
    },
    {
      id: 2,
      active: false,
      title: 'چطور می‌توانم از امتیازهای اسنپ‌‌ کلاب استفاده کنم؟',
      answer:
        'جایزه‌های مختلفی در قسمت «جایزه‌‌ها» در اسنپ ‌کلاب وجود دارد که میزان امتیاز لازم برای دریافت هر کدام مشخص شده است. ‏در صورت داشتن امتیاز کافی برای دریافت جایزه می‌توانید آن را انتخاب و دریافت کنید.‏‏',
    },
    {
      id: 3,
      active: false,
      title: 'چگونه می‌توانم امتیازهای دریافتی خود را ببینم؟',
      answer:
        'در صفحه اصلی برنامه اسنپ مجموع امتیازهای دریافتی شما نشان داده شده است. با کلیک بر روی «تاریخچه امتیازها» ‏امتیازهای خود را ببینید.‏‏‏',
    },
    {
      id: 4,
      active: false,
      title: 'در صورت فراموش کردن کد جایزه چه کار کنم؟',
      answer:
        'در هر زمان می‌توانید اطلاعات کامل جوایز خود را قسمت «جایزه‌های دریافتی» ببینید، آن را کپی کرده و استفاده کنید.‏',
    },
    {
      id: 5,
      active: false,
      title: 'امتیازهای اسنپ‌ کلاب تا چه مدت بعد از دریافت اعتبار دارند؟',
      answer:
        'این امتیازات محدودیتی ندارند و شما می‌توانید در هر زمانی از امتیازهای خود برای دریافت جایزه‌ استفاده کنید.‏‏',
    },
  ]

  const dataFooter = {
    img: clubFooter,
    icon: club,
    title: 'اسنپ‌ کلاب؛ باشگاه مشتریان اسنپ!‏',
    text:
      'برای دریافت امتیاز بیشتر و بهره‌مندی از اسنپ کلاب، اپلیکیشن اسنپ را نصب و از خدمات مختلف آن استفاده کنید.',
    button: 'ورود به اسنپ کلاب',
  }

  return (
    <div>
      <Layout id='0'>
        <Slider dataSlider={dataSlider} />
        <IconBar />
        <Banner dataBanner={dataBanner} />
        <Section dataSection={dataSection} />
        <DataSection />
        <FrequentlyQuestion questionData={questionData} />
        <BannerFooter dataFooter={dataFooter} />
      </Layout>
    </div>
  )
}

export default Club
