import React from 'react'

//component
import Slider from '../slider/Slider'
import IconBar from '../iconBar/IconBar'
import Banner from '../banner/Banner'
import Section from '../shared/section/Section'
import FrequentlyQuestion from '../shared/frequently-question/FrequentlyQuestion'
import BannerFooter from '../shared/banner-footer/BannerFooter'
import Layout from '../shared/Layout'

//image
import taxiSlider from './../../assets/img/taxi-ride-slider.jpg'
import easy from './../../assets/img/taxi-ride-card-1.png'
import clear from './../../assets/img/taxi-ride-card-2.png'
import support from './../../assets/img/taxi-ride-card-3.png'
import taxiRideSlider from '../../assets/img/taxi-ride-banner.jpg'
import taxiRequest1 from '../../assets/img/taxi-request-1.jpg'
import taxiRequest2 from '../../assets/img/taxi-request-2.jpg'
import taxiRequest3 from '../../assets/img/taxi-request-3.jpg'
import cab from '../../assets/img/cab.svg'
import taxiFooter from '../../assets/img/taxi-ride-banner-footer.jpg'

//video
import videoTaxi from '../../assets/video/taxi-ride.mp4'

const TaxiRide = () => {
  const dataSlider = {
    img: taxiSlider,
    title: 'تاکسی اینترنتی اسنپ، در رکاب شماست!',
    text:
      'اسنپ! اولین و بزرگترین تاکسی اینترنتی ایران است که برای جابه‌جایی در شهرهای بزرگ و کوچک ایران آماده خدمت‌رسانی به شماست.',
    buttonText: 'درخواست تاکسی',
    showInput: false,
    color: '#06d170',
  }

  const dataBanner = {
    img: taxiRideSlider,
    title: 'مزایای تاکسی اینترنتی اسنپ',
    text:
      'تاکسی اینترنتی اسنپ تحولی عظیم در سیستم حمل و نقل هوشمند محسوب می‌شود که هدفش برطرف کردن نیاز روزانه مردم برای سفر از نقطه‌ای به نقطه دیگر است.',
    cards: [
      {
        id: 1,
        imgCard: easy,
        titleCard: 'آسان و سریع',
        textCard:
          'با نصب سوپر اپلیکیشن اسنپ می‌توانید خیلی سریع و آسان، درخواست خودرو به مقصد مورد نظرتان را ثبت کنید.',
      },
      {
        id: 2,
        imgCard: clear,
        titleCard: 'قیمت‌گذاری شفاف',
        textCard:
          'قیمت‌گذاری در اسنپ کاملا رقابتی، منطقی و شفاف است. مبلغ هر سفر پیش از درخواست خودرو، اعلام خواهد شد.',
      },
      {
        id: 3,
        imgCard: support,
        titleCard: 'پشتیبانی تمام وقت',
        textCard:
          'پشتیبانی اسنپ به صورت ۲۴ ساعته و در تمام روزهای هفته، آماده کمک و پاسخ‌دهی به تمام سوالات شما است.',
      },
    ],
  }

  const dataSection = {
    requestData: [
      {
        number: 0,
        id: 'request-1',
        img: taxiRequest1,
        title: 'ثبت درخواست تاکسی اینترنتی',
        name: 'ثبت',
        text:
          'در سوپر اپلیکیشن اسنپ، آیکن «اسنپ!» را انتخاب کنید. ابتدا آدرس مبدأ و سپس مقصد خود را تعیین کنید. حالا می‌توانید نوع خودرو، مبلغ، گزینه‌های سفر و غیره را مشاهده و ویرایش کنید',
      },
      {
        number: 1,
        id: 'request-2',
        img: taxiRequest2,
        title: 'درخواست رفت و برگشت',
        name: 'رفت و برگشت',
        text:
          'می‌توانید در قسمت گزینه‌های سفر، درخواست رفت و برگشت را انتخاب کنید. در این حالت، تاکسی با رساندن شما به مقصد منتظر می‌ماند تا دوباره شما را به مبدأ برگرداند.',
      },
      {
        number: 2,
        id: 'request-3',
        img: taxiRequest3,
        title: 'ثبت توقف در مسیر',
        name: 'توقف',
        text:
          'اگر برای سوار شدن و رسیدن به تاکسی اسنپ زمان بیشتری لازم دارید یا باید برای چند دقیقه در محلی توقف داشته باشید، نیاز به اتمام سفر و درخواست مجدد برای تاکسی اینترنتی نیست و فقط کافی است مدت زمان توقف را در اپلیکیشن ثبت کنید.',
      },
    ],
    dataCard: [
      {
        id: 1,
        title: 'حفظ امنیت مسافران در طول سفر',
        text:
          'تاکسی اینترنتی اسنپ به منظور تأمین امنیت مسافران، «سرویس امنیت سفر» را به اپلیکیشن خود اضافه کرده است. با استفاده از این قابلیت، امکان تماس مستقیم با تیم ویژهی امنیت سفر، امکان به اشتراک گذاشتن موقعیت مکانی و تماس مستقیم با اورژانس برای مسافران فراهم شده است. سرویس امنیت سفر، با نشان یک سپر آبیرنگ در سمت چپ نقشه نمایش داده می‌شود. این سرویس تمام اقدامات و امکانات امنیتی اسنپ را به صورت متمرکز در خود جای میدهد.',
      },
      { id: 2, type: 'video', source: videoTaxi },
      {
        id: 3,
        title: 'امکان پرداخت نقدی و آنلاین',
        text:
          'همۀ ما گاهی اوقات پول نقد در جیب نداریم یا به دلیل شرایط همه گیری کرونا، ترجیح میدهیم مبلغ را آنلاین پرداخت کنیم. داشتن آزادی عمل در نوع پرداخت می‌تواند به قابلیت استفاده راحت از خدمات تاکسی اینترنتی بیفزاید. در سوپر اپلیکیشن اسنپ مسافران می‌توانند مبلغ سفر خود را به صورت پرداخت نقدی، آنلاین و یا از طریق کیف پول آپ پرداخت کنند.',
      },
      {
        id: 4,
        title: 'خبرهای جدید از تاکسی اینترنتی اسنپ',
        text:
          'با اطلاع از تازهترین اخبار مربوط به تاکسی اینترنتی اسنپ می‌توانید از قابلیتها و ویژگی‌های جدید این پلتفرم باخبر شوید. با به روز نگه داشتن اطلاع خود، امکان استفاده همه جانبه از سوپر اپلیکیشن اسنپ را خواهید داشت. با وبلاگ اسنپ همراه باشید.',
      },
    ],
    showWhiteCard: true,
    color: '#00d170',
  }

  const questionData = [
    {
      id: 0,
      active: false,
      title: 'نحوۀ استفاده از سرویس تاکسی اینترنتی اسنپ چگونه است؟',
      answer:
        'در ابتدا سوپراَپ اسنپ را روی گوشی همراه خود نصب کنید. سپس روی آیکون اسنپ! ضربه بزنید. ابتدا آدرس مبدأ و سپس مقصد خود را تعیین کنید. حالا می‌توانید نوع خودرو، مبلغ، گزینه‌های سفر و غیره را مشاهده و ویرایش کنید.',
    },
    {
      id: 1,
      active: false,
      title: 'سرویس تاکسی اینترنتی اسنپ دارای چند نوع خودرو است؟',
      answer:
        'در سوپر اپلیکیشن اسنپ می‌توانید نوع خودرو را در قالب «اسنپ اکو» و «اسنپ اکوپلاس» انتخاب کنید. اسنپ اکو شامل استفاده از خودروهای معمولی با قیمت مناسب است و اسنپ اکوپلاس شامل درخواست سفارش برای خودروهای با کیفیت و قیمت بیشتر است. خودروهای پلاس کیفیت بالاتری دارند و مدل خودروها از سال 85 به بالاست. ',
    },
    {
      id: 2,
      active: false,
      title: 'قیمت‌ها در تاکسی اینترنتی اسنپ چگونه تعیین می‌شود؟',
      answer:
        'قیمت هر سفر در اسنپ براساس چهار فاکتور اعم از «ورودی سفر»، «مسافت سفر»، «مدت زمان سفر» و «نسبت عرضه و تقاضا» تعیین می‌شود. ورودی سفر، مدت زمان سفر و مسافت سفر، «قیمت پایه» را تشکیل می‌دهند که هرچند ورودی و مسافت در یک سفر ثابت همیشه یکسان هستند. اما مدت زمان سفر با توجه به عواملی مانند ترافیک یا شرایط جوی خاص متغیر است. در نتیجه قیمت پایه سفرها در شرایطی که ورودی سفر و مسافت یکسان باشد به دلیل ترافیک و تغییر مدت زمان سفر می‌تواند تغییر کند. این قیمت پایه‌ متغیر خود متأثر از نسبت عرضه و تقاضاست. یک الگوریتم به‌صورت هوشمند نسبت عرضه و تقاضا را بررسی می‌کند و با توجه به آن به قیمت پایه اضافه یا از آن کم می‌شود.',
    },
    {
      id: 3,
      active: false,
      title: 'تاکسی اینترنتی اسنپ در چه شهرهایی فعال است؟',
      answer:
        'تاکسی اینترنتی اسنپ در تمام ۳۱ استان ایران، سرویس آنلاین حمل‌ونقل شهری را ارئه می‌دهد.',
    },
    {
      id: 4,
      active: false,
      title: 'آیا امکان ردیابی خودرو از مبدأ تا مقصد وجود دارد؟',
      answer: 'بله، از طریق اپلیکیشن اسنپ می‌توانید حرکت خودرو را ردیابی کنید.',
    },
    {
      id: 5,
      active: false,
      title: 'چطور می‌توانم با پشتیبانی تماس بگیرم؟',
      answer:
        'برای ارتباط مستقیم با پشتیبانی می‌توانید با شماره ۹۱۰۳۹۰۰۰-۰۲۱ تماس گرفته و منتظر پاسخگویی همکاران پشتیبانی ما باشید یا در صندوق صوتی ما پیغام ارسال کنید. ',
    },
  ]

  const dataFooter = {
    img: taxiFooter,
    icon: cab,
    title: 'تاکسی اینترنتی اسنپ، سریع و مطمئن',
    text:
      'هم‌اکنون سرویس درخواست تاکسی اسنپ، از طریق سیستم‌عامل‌های مختلف موبایل و وب اپلیکیشن به راحتی در دسترس شماست. بهترین خدمات تاکسی اینترنتی را با سوپر اپلیکیشن اسنپ تجربه کنید.',
    button: 'درخواست تاکسی',
  }

  return (
    <div>
      <Layout id='0'>
        <Slider dataSlider={dataSlider} />
        <IconBar />
        <Banner dataBanner={dataBanner} />
        <Section dataSection={dataSection} />
        <FrequentlyQuestion questionData={questionData} />
        <BannerFooter dataFooter={dataFooter} />
      </Layout>
    </div>
  )
}

export default TaxiRide
