import React from 'react'

//component
import Slider from '../slider/Slider'
import IconBar from '../iconBar/IconBar'
import Banner from '../banner/Banner'
import Section from '../shared/section/Section'
import FrequentlyQuestion from '../shared/frequently-question/FrequentlyQuestion'
import BannerFooter from '../shared/banner-footer/BannerFooter'
import Layout from '../shared/Layout'

//image
import trainTicketSlider from './../../assets/img/train-ticket-slider.jpg'
import flightTicketSection from './../../assets/img/flight-ticket-section.jpg'
import card1 from './../../assets/img/flight-card-1.png'
import card2 from './../../assets/img/flight-card-2.png'
import card3 from './../../assets/img/flight-card-3.png'
import flightRequest1 from '../../assets/img/flight-request-1.jpg'
import flightRequest2 from '../../assets/img/flight-request-2.jpg'
import flightRequest3 from '../../assets/img/flight-request-3.jpg'
import flightFooter from '../../assets/img/flight-footer.jpg'
import flightImg from '../../assets/img/flight-img.jpg'
import flight from '../../assets/img/Domestic Trip.png'

const FlightsTicket = () => {
  const dataSlider = {
    img: trainTicketSlider,
    title: 'خرید بلیط قطار اسنپ',
    text:
      'دیگر خبری از شلوغی خیابان و ترافیک جاده نیست! با سوپراپلیکیشن اسنپ خرید آنلاین بلیط قطار برای مسافرین عزیز ساده تر شده است. خدمات اسنپ به مسافران این امکان را می‌دهد که نوع بلیط و قطار مورد نظر خود را در منزل تهیه کنند.',
    buttonText: 'خرید بلیط قطار',
    showInput: false,
    color: '#ff4340',
  }

  const dataBanner = {
    img: flightTicketSection,
    title: 'مزایای خرید بلیط هواپیما از اسنپ',
    text:
      'اسنپ‌ با ارائه راهکارهای اساسی به دنبال ساده‌سازی و سرعت بخشیدن به جریان عادی زندگی مردم است.',
    cards: [
      {
        id: 1,
        imgCard: card1,
        titleCard: 'رزرو بلیط هواپیما با بهترین قیمت',
        textCard:
          'اسنپ‌ برای مسیرهای مختلف تخفیف‌های ویژه‌ای در نظر گرفته است. مسافران می‌توانند ارزان‌ترین قیمت بلیط پرواز را با اسنپ تجربه کنند.',
      },
      {
        id: 2,
        imgCard: card2,
        titleCard: 'تنوع در نوع بلیط و شرکت‌های هواپیمایی',
        textCard:
          'مسافران برای خرید آنلاین بلیط پرواز داخلی از بین انواع بلیط (اکونومی یا بیزینس) و ایرلاین‌های مختلف حق انتخاب دارند.',
      },
      {
        id: 3,
        imgCard: card3,
        titleCard: 'پشتیبانی تمام وقت',
        textCard:
          'پشتیبانی اسنپ به صورت ۲۴ ساعته و در تمام روزهای هفته، آماده کمک و پاسخ‌دهی به تمام سوالات شما است.',
      },
    ],
  }

  const dataSection = {
    requestData: [
      {
        number: 0,
        id: 'request-1',
        img: flightRequest1,
        title: 'نحوه رزرو بلیط هوایپما',
        name: 'رزرو بلیط',
        text:
          'وارد سوپراپ اسنپ شوید. گزینۀ «بلیت سفر» را انتخاب کنید. سپس چهار گزینه برای شما ظاهر می‌شوند. گزینۀ پرواز را انتخاب کنید تا وارد صفحه اصلی اسنپ‌تریپ شوید. با مشخص کردن مبدأ، مقصد، تاریخ سفر و تعداد مسافران می‌توانید لیستی از ایرلاین‌های مختلف با شرایط و امکانات گوناگون را مشاهده کنید.',
      },
      {
        number: 1,
        id: 'request-2',
        img: flightRequest2,
        title: 'فیلترهای قابل انتخاب',
        name: 'انتخاب دقیق',
        text:
          'بعد از مشاهدۀ لیست شرکت‌های هواپیمایی، می‌توانید از فیلترهای ارزان‌ترین، گران‌ترین، بیشترین تخفیف، زودترین، دیرترین ساعت، زمان حرکت، نوع پرواز، کلاس پروازی و غیره جهت راحتی هر چه بیشتر خود در جستجوی بهترین بلیط استفاده کنید.',
      },
      {
        number: 2,
        id: 'request-3',
        img: flightRequest3,
        title: 'قوانین استرداد بلیط هواپیما',
        name: 'استرداد بلیط',
        text:
          'بعد از انتخاب گزینه مورد نظر خود، اکنون وارد صفحه‌ای می‌شوید که جزئیات قسمت و اطلاعات پرواز آماده است. در قسمت پایین قوانین و شرایط کنسلی بلیط وجود دارد. حد جریمه کنسلی بر طبق قوانین سازمان هواپیمایی تدوین شده است. مهم است این قسمت را کامل بخوانید.',
      },
    ],
    dataCard: [
      {
        id: 1,
        title: 'بلیط هواپیما از معتبرترین ایرلاین‌ها',
        text:
          'ایرلاین‌های معتبر زیادی در اسنپ‌تریپ آمادۀ ارائۀ بلیط پروازهای داخلی هستند. از شرکت‌های هواپیمایی مطرح می‌توان به ماهان، زاگرس، کیش ایر، قشم ایر، آسمان، کاسپین، تابان، وارش و معراج اشاره کرد. هر یک از این ایرلاین‌ها ویژگی‌های مختص به خود را دارند. برخی از آنها امکانات و خدمات رفاهی بیشتر دارند و بعضی دیگر بلیط هواپیما را با قیمت پایین‌تر ارائه می‌دهند.',
      },
      { id: 2, type: 'img', source: flightImg },
      {
        id: 3,
        title: 'تنوع در نوع بلیط و کلاس پروازی',
        text:
          'در سوپراپلیکیشن اسنپ کلیه خدمات جهت راحتی حال مسافران در نظر گرفته شده است. مسافران عزیز می‌توانند در بخش فیلترها نوع پرواز و کلاس پروازی خود را انتخاب کنند. برای نوع پرواز امکان انتخاب بلیط سیستمی و چارتری وجود دارد. همچنین در بخش کلاس پروازی می‌توان از گزینه‌های اکونومی و بیزنس استفاده کرد.',
      },
      {
        id: 4,
        title: 'دانستی‌های سفر با اسنپ‌تریپ',
        text:
          'در مجله اسنپ‌تریپ می‌توان هر اطلاعاتی که برای سفر نیاز است را یکجا به دست آورید. از موضوعات مربوط به ایران گردی گرفته تا معرفی جاذبه‌های دیدنی جهان و رستوران‌های مشهور دنیا، اسنپ‌تریپ بستری برای کسب دانش برای کسب تجربه سفری لذت بخش و ایمن است.',
      },
    ],
    color: '#ff4340',
  }

  const questionData = [
    {
      id: 0,
      active: false,
      title: '‏برای خرید بلیط پرواز داخلی از اسنپ به چه امکاناتی نیاز داریم؟',
      answer:
        'دسترسی به اینترنت از طریق لپ تاپ، تبلت یا تلفن همراه و در اختیار داشتن مشخصات کارت ‏بانکی در یکی از بانک‌های عضو شبکه شتاب به همراه رمز دوم برای هر خرید اینترنتی بلیط هواپیما ‏ضروری است.‏‏‏',
    },
    {
      id: 1,
      active: false,
      title:
        'بعد از خرید آنلاین بلیط هواپیما چطور می‌توانم بلیط خودم را دریافت کنم؟',
      answer:
        'بعد از کامل‌کردن اطلاعات خود و پرداخت آنلاین مبلغ بلیط، لینک دانلود بلیط از طریق پیامک و ‏ایمیل برای شما ارسال می‌شود. با ورود به این لینک می‌توانید بلیط خود را دانلود کنید.‏‏‏',
    },
    {
      id: 2,
      active: false,
      title: '‏میزان بار مجاز برای هر بلیط هواپیما چقدر است؟',
      answer:
        'بسته به نوع شرکت هواپیمایی میزان بار مجاز برای هر نفر متفاوت است. میزان بار مجاز هر نفر را ‏می‌توانید در زمان خرید آنلاین بلیط مشاهده کنید.‏',
    },
    {
      id: 3,
      active: false,
      title: 'جریمه کنسلی بلیط هواپیما چطور محاسبه می‌شود؟',
      answer:
        'جریمه کنسلی بلیط پرواز داخلی به عوامل مختلفی از جمله شرکت هواپیمایی و ساعتی بستگی دارد ‏که برای استرداد بلیط هواپیما اقدام می‌کنید. برای مشاهده درصد جریمه کنسلی بلیط می‌توانید به ‏صفحه قوانین و مقررات مراجعه کنید.‏',
    },
    {
      id: 4,
      active: false,
      title: '‏در فرودگاه و هنگام سوار شدن به هواپیما چه مدارکی لازم است؟',
      answer:
        'ارائه بلیط (نسخه چاپ شده یا تصویر آن بر روی گوشی تلفن همراه یا تبلت) یا شماره بلیط و کارت ‏شناسایی معتبر (شناسنامه یا کارت ملی یا گواهینامه‌ی رانندگی یا گذرنامه) ضروری است.‏',
    },
    {
      id: 5,
      active: false,
      title:
        'کد تخفیف یا امتیاز همراهی چیست و چطور می‌توان آنها را دریافت کرد؟',
      answer:
        'با عضو شدن و فعالیت در اسنپ‌ می‌توان کد تخفیف و امتیاز همراهی دریافت کرد. در زمان سفر ‏می‌توان از کدهای تخفیف و امتیازهای همراهی برای کاهش هزینه خرید بلیط استفاده کرد.‏',
    },
  ]

  const dataFooter = {
    img: flightFooter,
    icon: flight,
    title: 'اسنپ، آسان‌ترین راه برای خرید بلیط پرواز داخلی‏',
    text:
      'هم‌اکنون خدمات فروش بلیط هواپیما، از طریق سیستم‌عامل‌های مختلف موبایل و وب اپلیکیشن اسنپ به راحتی در دسترس شماست. سیر و سفر را با خدمات گردشگری اسنپ تجربه کنید.',
    button: 'خرید بلیط هواپیما',
  }

  return (
    <div>
      <Layout id='0'>
        <Slider dataSlider={dataSlider} />
        <IconBar />
        <Banner dataBanner={dataBanner} />
        <Section dataSection={dataSection} />
        <FrequentlyQuestion questionData={questionData} />
        <BannerFooter dataFooter={dataFooter} />
      </Layout>
    </div>
  )
}

export default FlightsTicket
