import React from 'react'

//component
import Slider from '../slider/Slider'
import IconBar from '../iconBar/IconBar'
import Banner from '../banner/Banner'
import Section from '../shared/section/Section'
import FrequentlyQuestion from '../shared/frequently-question/FrequentlyQuestion'
import BannerFooter from '../shared/banner-footer/BannerFooter'
import Layout from '../shared/Layout'

//image
import hotelsSlider from './../../assets/img/hotels-slider.jpg'
import hotelsSection from './../../assets/img/hotels-section.jpg'
import card1 from './../../assets/img/hotels-card-1.png'
import card2 from './../../assets/img/hotels-card-2.png'
import card3 from './../../assets/img/hotels-card-3.png'
import hotelsRequest1 from '../../assets/img/hotels-request-1.jpg'
import hotelsRequest2 from '../../assets/img/hotels-request-2.jpg'
import hotelsRequest3 from '../../assets/img/hotels-request-3.jpg'
import hotelsImg from '../../assets/img/hotels-img.jpg'
import hotelsFooter from '../../assets/img/hotels-footer.jpg'
import hotel from '../../assets/img/hotel.png'

const Hotels = () => {
  const dataSlider = {
    img: hotelsSlider,
    title: 'رزرو هتل، آسان و سریع با اسنپ!',
    text:
      'سوپراپلیکیشن اسنپ با ارائه پلتفرم اسنپ تریپ توانسته بزرگترین و معتبرترین سایت رزرو هتل در ایران را راه اندازی کند. مسافران عزیز می‌توانند با حذف واسطه در فرآیند رزرو هتل از قیمت روز هتل‌ها و مراکز اقامتی داخلی و خارجی اطلاع پیدا کنند و از انواع تخفیف‌های لحظه‌ای باخبر شوند.',
    buttonText: ' رزرو هتل',
    showInput: false,
    color: '#ff4340',
  }

  const dataBanner = {
    img: hotelsSection,
    title: 'مزایای رزرو هتل با اسنپ',
    text:
      'اسنپ‌ با ارائه راهکارهای اساسی به دنبال ساده‌سازی و سرعت بخشیدن به جریان عادی زندگی مردم است.‏',
    cards: [
      {
        id: 1,
        imgCard: card1,
        titleCard: 'رزرو سریع و مطمئن هتل',
        textCard:
          'با نصب سوپراپلیکیشن اسنپ می‌توان در سریع‌ترین زمان ممکن و با اطمینان کامل، هتل مورد نظر را به صورت آنلاین رزرو کرد.',
      },
      {
        id: 2,
        imgCard: card2,
        titleCard: 'تنوع گسترده در انواع هتل',
        textCard:
          'لیست گسترده‌ای از انواع هتل، هتل آپارتمان، بوتیک هتل، مهمان‌سرا و اقامتگاه بومگردی با قیمت‌ها و امکانات مختلف در دسترس مسافران قرار دارند.',
      },
      {
        id: 3,
        imgCard: card3,
        titleCard: 'پشتیبانی تمام وقت',
        textCard:
          'پشتیبانی اسنپ به صورت ۲۴ ساعته و در تمام روزهای هفته، آماده کمک و پاسخ‌دهی به تمام سوالات شما است.',
      },
    ],
  }

  const dataSection = {
    requestData: [
      {
        number: 0,
        id: 'request-1',
        img: hotelsRequest1,
        title: 'نحوه رزرو هتل',
        name: 'رزرو هتل ',
        text:
          'وارد سوپراپ اسنپ شوید. گزینه «هتل» را انتخاب کنید. سپس می‌توانید گزینه‌های مختلف از جمله هتل و اقامتگاه داخلی و خارجی و اقامتگاه‌های اقتصادی را مشاهده کنید. با انتخاب هر گزینه وارد صفحه اصلی آن می‌شوید که در این صفحه باید مقصد و تاریخ سفر را مشخص کند. سپس لیست گسترده ای از هتل ها نمایش داده می‌شود.',
      },
      {
        number: 1,
        id: 'request-2',
        img: hotelsRequest2,
        title: 'فیلترهای قابل انتخاب',
        name: 'انتخاب دقیق',
        text:
          'بعد از مشاهده لیست هتل‌ها می‌توانید از گزینه فیلترها استفاده کنید. در فیلترها امکان تنظیم مقدار قیمت، تخفیف‌ها، نوع اقامتگاه، درجه هتل (تعداد ستاره) و هتل های پیشنهادی و بدون جریمه وجود دارد. استفاده از فیلترها کار شما را برای جستجو راحت‌تر می‌کند. ',
      },
      {
        number: 2,
        id: 'request-3',
        img: hotelsRequest3,
        title: 'مشاهده اطلاعات هتل',
        name: 'اطلاعات هتل',
        text:
          'بعد از انتخاب هتل مورد نظر خود، اکنون می‌توانید مشخصات و اطلاعات اقامتگاه انتخابی خود را مشاهده کنید. در این صفحه مواردی مانند آدرس، اطلاعات و امکانات هتل، قوانین رزرو، قیمت و مشخصات هر هتل از نظر خدمات قابل مشاهده و انتخاب هستند.',
      },
    ],
    dataCard: [
      {
        id: 1,
        title: 'رزرو اقامتگاه در بهترین و ارزان‌ترین هتل‌ها',
        text:
          'با استفاده از ویژگی‌های متنوع اسنپ‌تریپ می‌توانید با مقایسه‌ امکانات هتل، نظرات کاربران و مشاهده تصاویر اتاق‌های هتل، میان قیمت و کیفیت تعادل برقرار کنید و به تناسب نیازهای خود، بهترین هتل را انتخاب کنید. هتل‌های 4 و 5 ستاره معمولاً قیمت بیشتری دارند اما بالاترین خدمات و امکانات را ارائه می‌دهند. هتل‌ها با تعداد ستاره کمتر امکانات معقولی دارند و به صرفه جویی در هزینه‌ها کمک می‌کنند.',
      },
      { id: 2, type: 'img', source: hotelsImg },
      {
        id: 3,
        title: 'امکان رزرو هتل در مقاصد خارج از ایران',
        text:
          'یکی از ویژگی های فوق العاده سوپراپ اسنپ، امکان رزرو هتل خارجی است. مسافرانی که قصد سفر به استانبول، دبی، باکو، پاریس، آنکارا، تفلیس، آنتالیا و شهرهای معروف و توریستی جهان را دارند، می‌توانند از اسنپ‌تریپ برای رزرو هتل خود استفاده کنند. با انتخاب گزینه مورد نظر می‌توانید طیف گسترده‌ای از هتل‌ها با امکانات مختلف را مشاهده کنید.',
      },
      {
        id: 4,
        title: 'ارائه قیمت‌ها و تخفیف‌های هیجان انگیز',
        text:
          'سرویس‌های موجود در اسنپ‌تریپ با تخفیف‌های متنوع و هزینه‌های کم ارائه می‌شوند. شما می‌توانید این تخفیف‌ها را در بسیاری از روزهای سال مشاهده کنید و از خدمات آن بهره‌مند شوید. به ویژه در روزهای مهم سال و تعطیلات عید نوروز، تخفیف‌های هیجان انگیزی زیادی در سوپراپ اسنپ برای رضایت حال مسافران ارائه می‌شوند.',
      },
    ],
    color: '#ff4340',
  }

  const questionData = [
    {
      id: 0,
      active: false,
      title: 'برای رزرو هتل از اسنپ تریپ به چه مواردی نیاز است؟',
      answer:
        'دسترسی به اینترنت از طریق لپ تاپ، تبلت یا گوشی تلفن همراه و در اختیار داشتن مشخصات کارت بانکی در یکی از بانک‌های ‏عضو شبکه شتاب به همراه رمز دوم آن برای هر رزرو آنلاین هتل ضروری است.‏',
    },
    {
      id: 1,
      active: false,
      title: 'تغییر تاریخ رزرو هتل امکان پذیر است؟',
      answer:
        'با تماس به پشتیبانی سایت اسنپ‌، همکاران ما در ۲۴ ساعت روز پاسخگوی شما هستند و درخواست انتقال رزرو به تاریخ ‏مورد نظر مورد بررسی قرار می‌گیرد درصورت موجود بودن اتاق در تاریخ مذکور انتقال رزرو با موفقیت ثبت می‌شود.‏',
    },
    {
      id: 2,
      active: false,
      title: 'آیا می‌توان رزرو هتل را لغو کرد؟',
      answer:
        'امکان کنسلی در هر مرحله از رزرو تا قبل از تحویل اتاق وجود دارد. اما بسته به اینکه زمان درخواست کنسلی شما چند روز قبل ‏از تاریخ ورود باشد یا دقیقا در روز ورود درخواست کنسلی بدهید، میزان جریمه کنسلی متفاوت خواهد بود. اسنپ‌ جریمه ‏کنسلی از مهمان دریافت نمی‌کند. جریمه کنسلی از طرف هتل دریافت می‌شود.‏',
    },
    {
      id: 3,
      active: false,
      title: 'برای رزرو هتل تا چند روز قبل از سفر فرصت داریم؟',
      answer:
        'امکان کنسلی در هر مرحله از رزرو تا قبل از تحویل اتاق وجود دارد. اما بسته به اینکه زمان درخواست کنسلی شما چند روز قبل ‏از تاریخ ورود باشد یا دقیقا در روز ورود درخواست کنسلی بدهید، میزان جریمه کنسلی متفاوت خواهد بود. اسنپ‌ جریمه ‏کنسلی از مهمان دریافت نمی‌کند. جریمه کنسلی از طرف هتل دریافت می‌شود.‏',
    },
    {
      id: 4,
      active: false,
      title: 'آیا امکان تمدید هتل وجود دارد؟',
      answer:
        'در صورتی که اتاق موجود نباشد و یا به شخص دیگری در آن روز رزرو داده شده باشد امکان تمدید وجود ندارد. برای تمدید از ‏‏۲۴ ساعت قبل با اسنپ‌ هماهنگ کنید.‏',
    },
    {
      id: 5,
      active: false,
      title: 'در زمان تحویل هتل چه مدارک شناسایی همراه داشته باشم؟',
      answer:
        'بر اساس قوانین جمهوری اسلامی ایران، برای اقامت در هتل باید مدارک شناسایی و مدارک اثبات محرمیت را به همراه داشته ‏باشید؛ اما بعضی از میزبان‌ها با شرایط مهمان موافقت می‌کنند. می‌توانید به انتهای صفحه بروید و بخش قوانین هتل را مطالعه ‏کنید.‏',
    },
  ]

  const dataFooter = {
    img: hotelsFooter,
    icon: hotel,
    title: 'رزرو هتل با اسنپ‏',
    text:
      'هم‌اکنون خدمات رزرو هتل، از طریق سیستم‌عامل‌های مختلف موبایل و وب اپلیکیشن اسنپ به راحتی در دسترس شماست. سیر و سفر را با خدمات گردشگری اسنپ تجربه کنید.',
    button: ' رزرو هتل',
  }

  return (
    <div>
      <Layout id='0'>
        <Slider dataSlider={dataSlider} />
        <IconBar />
        <Banner dataBanner={dataBanner} />
        <Section dataSection={dataSection} />
        <FrequentlyQuestion questionData={questionData} />
        <BannerFooter dataFooter={dataFooter} />
      </Layout>
    </div>
  )
}

export default Hotels
