import React from 'react'

//component
import Slider from '../slider/Slider'
import IconBar from '../iconBar/IconBar'
import Banner from '../banner/Banner'
import Section from '../shared/section/Section'
import FrequentlyQuestion from '../shared/frequently-question/FrequentlyQuestion'
import BannerFooter from '../shared/banner-footer/BannerFooter'
import Layout from '../shared/Layout'

//image
import investmentSlider from './../../assets/img/investment-services-slider.jpg'
import investmentSection from './../../assets/img/investment-section.jpg'
import card1 from './../../assets/img/investment-card-1.png'
import card2 from './../../assets/img/investment-card-2.png'
import card3 from './../../assets/img/investment-card-3.png'
import investmentRequest1 from '../../assets/img/investment-request-1.jpg'
import investmentRequest2 from '../../assets/img/investment-request-2.jpg'
import investmentRequest3 from '../../assets/img/investment-request-3.jpg'
import investmentFooter from '../../assets/img/investment-footer.jpg'
import investment from '../../assets/img/Service Icon.png'
import investmentImg from '../../assets/img/investment-img.jpg'

const InvestmentServices = () => {
  const dataSlider = {
    img: investmentSlider,
    title: 'مدیریت بهینه سرمایه با اسنپ!',
    text:
      'سوپراپلیکشن اسنپ با تکیه بر تخصص و دانش فنی خود و همکاری با شرکت‌‌های معتبر و شناخته‌‌شده‌ بازار سرمایه، پلتفرم «سرمایه‌گذاری» را راه‌اندازی کرده است. در این سرویس کاربران می‌توانند از خدمات آنلاین و غیرحضوری برای مدیریت سرمایه خود در بازار بورس به شکلی ایمن و آسان استفاده کنند.',
    buttonText: 'شروع به سرمایه گذاری',
    showInput: false,
    color: '#028ef9',
  }

  const dataBanner = {
    img: investmentSection,
    title: 'مزایای استفاده از سامانه سرمایه گذاری اسنپ!',
    text:
      'پلتفرم مدیریت سرمایه گذاری با ارائه راهکارهای اساسی به دنبال ساده‌سازی و سرعت بخشیدن به جریان عادی زندگی مردم است.',
    cards: [
      {
        id: 1,
        imgCard: card1,
        titleCard: 'امکان دسترسی آسان به بازار بورس',
        textCard:
          'کاربران با استفاده از سوپراپلیکیشن اسنپ می‌توانند دسترسی سریع و آسانی به بازار بورس، سامانه‌های سجام، سهام عدالت و سایر موارد داشته باشند.',
      },
      {
        id: 2,
        imgCard: card2,
        titleCard: 'تأمین امنیت اطلاعات کاربران',
        textCard:
          'هیچ‌کدام از اطلاعات درخواستی و دریافتی برای ثبت نام و احراز هویت کاربران در اپلیکیشن اسنپ ذخیره نخواهد شد.',
      },
      {
        id: 3,
        imgCard: card3,
        titleCard: 'پشتیبانی تمام وقت',
        textCard:
          'پشتیبانی اسنپ به صورت ۲۴ ساعته و در تمام روزهای هفته، آماده کمک و پاسخ‌دهی به تمام سوالات شما است.',
      },
    ],
  }

  const dataSection = {
    requestData: [
      {
        number: 0,
        id: 'request-1',
        img: investmentRequest1,
        title: 'شروع سرمایه گذاری',
        name: 'سرمایه گذاری',
        text:
          'وارد سوپراپلیکیشن اسنپ بشوید. گزینه را سرمایه گذاری  انتخاب کنید. سپس وارد صفحه اصلی می‌شوید. در این صفحه گزینه‌های مدیریت سرمایه، سهام عدالت، ثبت نام سجام و احراز هویت وجود دارند. هر یک را بسته به نیاز خود انتخاب کنید.',
      },
      {
        number: 1,
        id: 'request-2',
        img: investmentRequest2,
        title: 'ثبت نام سجام',
        name: 'سجام',
        text:
          'با وارد شدن به پلتفرم سرمایه گذاری، می‌توانید گزینه ثبت‌نام سجام را انتخاب کنید. سپس باید 8 مرحله از احراز هویت که شامل درج اطلاعات شخصی است را یکی پس از دیگری انجام دهید.',
      },
      {
        number: 2,
        id: 'request-3',
        img: investmentRequest3,
        title: 'خدمات سهام عدالت',
        name: 'سهام عدالت',
        text:
          'در قسمتی از سامانه سرمایه گذاری اسنپ، خدمات سهام عدالت عرضه می‌شود. در این بخش می‌توانید سهامدار جدید اضافه کنید، کارگزاری خود را تغییر دهید، ارزش سهام خود را مشاهده کنید یا اقدام به فروش سهام عدالت کنید.',
      },
    ],
    dataCard: [
      {
        id: 1,
        title: 'کسب سود در انواع صندوق سرمایه گذاری',
        text:
          'در سوپراپلیکیشن اسنپ امکان استفاده از انواع صندوق سرمایه گذاری برای کسب سود وجود دارد. ‏متداول‌ترین تقسیم بندی صندوق‌های سرمایه گذاری بر اساس ترکیب نوع دارایی‌ها و قابلیت معامله ‏واحدهای سرمایه گذاری انجام می‌شود که شامل صندوق‌های در سهام، مختلط و در اوراق بهادار با ‏درآمد ثابت است.‏',
      },
      { id: 2, type: 'img', source: investmentImg },
      {
        id: 3,
        title: 'ثبت نام غیرحضوری در سامانه سجام',
        text:
          'شما می‌توانید از طریق بخش سرمایه گذاری سوپراپ اسنپ، نسبت به سجامی شدن خود به صورت کاملاً غیرحضوری اقدام کنید. ثبت‌نام در این سامانه جایگزین ارائه تمامی مدارک و اطلاعات ضروری شده است. با ثبت نام در ساجام می‌توانید از بازار سرمایه خدماتی مانند خریدوفروش اوراق بهادار و صدور و ابطال واحدهای صندوق‌های سرمایه‌گذاری و موارد دیگر را دریافت کنید.',
      },
      {
        id: 4,
        title: 'سرمایه گذار مبتنی بر صدور و ابطال',
        text:
          'چنانچه صندوق مورد نظر سرمایه گذار مبتنی بر صدور و ابطال باشد، سرمایه‌گذاران می‌توانند پس‌ از ثبت‌نام در سامانه مدیریت سرمایه نسبت به درخواست صدور یا همان خرید واحدهای سرمایه گذاری اقدام کنند.',
      },
    ],
    color: '#028ef9',
  }

  const questionData = [
    {
      id: 0,
      active: false,
      title:
        'برای ثبت نام در سامانه مدیریت سرمایه گذاری، چه مدارکی مورد نیاز است؟',
      answer:
        'اگر سجامی هستید، نیازی به هیچ گونه مدارک شناسایی نیست. کافی است با مراجعه به سامانه ‏مدیریت سرمایه نوین و وارد کردن کد ملی و کد تأیید شرکت سپرده گذاری، نسبت به ثبت نام ‏اقدام کنید. اگر سجامی نیستید، می توانید با مراجعه به بخش سرمایه گذاری اسنپ یا سایت سپرده ‏گذاری ابتدا سجامی شوید سپس اقدام به ثبت نام کنید.‏',
    },
    {
      id: 1,
      active: false,
      title: 'سجام چیست و چگونه سجامی شویم؟',
      answer:
        'سجام مخفف سامانه جامع ثبت اطلاعات مشتریان است که توسط شرکت سپرده‌گذاری مرکزی ‏اوراق بهادار و تسویه وجوه و زیر نظر سازمان بورس با هدف ایجاد سامانه یکپارچه و ارائه خدمات ‏بهتر و سریع‌تر به سرمایه‌گذاران ایجاد شده است. شما می‌توانید از طریق بخش سرمایه‌گذاری ‏اپلیکیشن اسنپ، نسبت به سجامی شدن خود به صورت کاملا غیر حضوری اقدام کنید.‏‏',
    },
    {
      id: 2,
      active: false,
      title: 'صندوق سرمایه گذاری چیست؟',
      answer:
        'صندوق سرمایه‌گذاری یک نهاد مالی است که تحت نظارت و با اخذ مجوز از سازمان بورس و اوراق ‏بهادار فعالیت می‌کند. مدیریت دارایی‌ها از طریق صندوق‌های سرمایه‌گذاری این امکان را فراهم ‏می‌آورد که سرمایه‌گذاران ضمن حفظ دارایی‌هایشان، در هر سطحی از ریسک‌پذیری، بیشترین ‏بازدهی ممکن را کسب کنند.‏',
    },
    {
      id: 3,
      active: false,
      title:
        'حداقل تعداد واحد قابل خریداری در صندوق‌های سرمایه‌گذاری چه تعداد است؟',
      answer:
        'حداقل تعداد واحد قابل خریداری در صندوق های سرمایه‌‌گذاری یک واحد است. چنانچه ظرفیت ‏یک صندوق پر باشد، گزینه صدور آن صندوق غیرفعال خواهد شد.‏',
    },
    {
      id: 4,
      active: false,
      title:
        'برای فروش سهام عدالت باید در سجام ثبت نام کرد یا احراز هویت انجام داد؟',
      answer:
        'خیر، برای فروش سهام عدالت نیازی به ثبت نام در سجام و احراز هویت نیست.‏',
    },
    {
      id: 5,
      active: false,
      title:
        'چرا بعد از ثبت درخواست صدور، تعداد واحدهای صندوق افزایش پیدا نمی‌کند؟',
      answer:
        'افزایش تعداد واحدهای صندوق پس از تأیید نهایی نرخ صدور انجام می‌شود‎.‎‏ بنابراین در صورت ‏تأیید سفارش صدور، تعداد واحدهای سرمایه گذاری شما در داشبورد حساب کاربری‌تان حداکثر ‏ظرف دو روز کاری در صندوق‌های درآمد ثابت و سه روز کاری در صندوق های سهامی افزایش ‏خواهد یافت. نرخ صدوری که در تمام صندوق‌های سرمایه‌گذاری مشاهده می‌کنید مربوط به روز ‏قبل می‌باشد، بنابراین نرخ صدور امروز یک روز کاری بعد مشخص خواهد شد.‏',
    },
  ]

  const dataFooter = {
    img: investmentFooter,
    icon: investment,
    title: 'مدیریت سرمایه با اسنپ!‏',
    text:
      'هم‌اکنون خدمات سرمایه گذاری، از طریق سیستم‌عامل‌های مختلف موبایل و وب اپلیکیشن به راحتی در دسترس شماست. سرمایه گذاری هوشمند را با سوپر اپلیکیشن اسنپ تجربه کنید.',
    button: 'شروع به سرمایه گذاری',
  }

  return (
    <div>
      <Layout id='0'>
        <Slider dataSlider={dataSlider} />
        <IconBar />
        <Banner dataBanner={dataBanner} />
        <Section dataSection={dataSection} />
        <FrequentlyQuestion questionData={questionData} />
        <BannerFooter dataFooter={dataFooter} />
      </Layout>
    </div>
  )
}

export default InvestmentServices
