import React from 'react'

//component
import Slider from '../slider/Slider'
import IconBar from '../iconBar/IconBar'
import Banner from '../banner/Banner'
import Section from '../shared/section/Section'
import BannerFooter from '../shared/banner-footer/BannerFooter'
import Article from '../shared/article/Article'
import Layout from '../shared/Layout'

//image
import juiceSlider from './../../assets/img/juice-slider.jpg'
import juiceSection from './../../assets/img/juice-section.jpg'
import card1 from './../../assets/img/juice-card-1.png'
import card2 from './../../assets/img/juice-card-2.png'
import card3 from './../../assets/img/juice-card-3.png'
import juiceRequest1 from '../../assets/img/juice-request-1.jpg'
import juiceRequest2 from '../../assets/img/juice-request-2.jpg'
import juiceRequest3 from '../../assets/img/juice-request-3.jpg'
import juiceFooter from '../../assets/img/juice-footer.jpg'
import food from '../../assets/img/food.svg'
import chaharfasl from '../../assets/img/4fasl.jpg'
import a from '../../assets/img/a.jpg'
import bahar from '../../assets/img/bahar.jpg'
import cityStar from '../../assets/img/city-star.jpg'
import sajad from '../../assets/img/sajad.jpg'
import shaho from '../../assets/img/shaho.jpg'
import tootFarangi from '../../assets/img/toot-farangi.jpg'
import valis from '../../assets/img/valis.jpg'

const Juice = () => {
  const dataSlider = {
    img: juiceSlider,
    title: 'سفارش آنلاین آبمیوه و بستنی',
    text:
      'دورهمی‌تان بستنی خوشمزه کم دارد؟ تماشای فیلم موردعلاقه‌تان با آبمیوه خنک بیشتر می‌چسبد؟ شاید هم بعد از یک روز کاری پرفشار به استراحت و نوشیدن یک لیوان لیموناد خنک یا آب هندوانه تازه نیاز دارید! در هر صورت، با اسنپ انواع آبمیوه یا بستنی را سفارش بدهید و راحت و سریع در محل دلخواه‌تان تحویل بگیرید.',
    buttonText: 'سفارش دهید',
    showInput: false,
    color: '#ff00a6',
  }

  const dataBanner = {
    img: juiceSection,
    title: 'مزایای سفارش آنلاین آبمیوه و بستنی',
    text:
      'با سفارش آنلاین آبمیوه و بستنی از اسنپ می‌توانید:بدون خارج ‌شدن از خانه یا محل کار، خوراکی دلخواه‌تان را از فروشگاه موردنظرتان بخرید.منوهای متنوع ده‌ها فروشگاه‌ مختلف دور و نزدیک را ببینید و قیمت‌ها را مقایسه کنید.با سلیقه خودتان سفارش را ثبت کنید.سفارش موردنظرتان را با بسته‌بندی مناسب و سریع تحویل بگیرید.',
    cards: [
      {
        id: 1,
        imgCard: card1,
        titleCard: 'دسترسی به بهترین فروشگاه‌ها',
        textCard:
          'در خیابان، دنبال بستنی یا آبمیوه‌فروشی نگردید! بهترین‌ها در اسنپ منتظر شما هستند.',
      },
      {
        id: 2,
        imgCard: card2,
        titleCard: 'منوهایی برای سلیقه شما',
        textCard:
          'هوس بستنی یا آبمیوه با شما، منوی بی‌نظیر و متنوع فروشگاه‌های مختلف با ما.',
      },
      {
        id: 3,
        imgCard: card3,
        titleCard: 'ارسال سریع و باکیفیت',
        textCard:
          'نگران آب‌شدن بستنی یا گرم‌شدن آبمیوه‌تان نباشید. زودتر از آنچه فکرش را بکنید، درب منزل شماست.',
      },
    ],
  }

  const dataSection = {
    requestData: [
      {
        number: 0,
        id: 'request-1',
        img: juiceRequest1,
        title: 'انتخاب آبمیوه و بستنی‌فروشی از بین بهترین‌ها',
        name: 'انتخاب فروشگاه موردنظر',
        text:
          'منوهای بهترین فروشگاه‌های اطراف را بررسی و قیمت‌ها را مقایسه کنید و تخفیف‌های هر فروشگاه را ببینید. شما می‌توانید خوراکی دلخواه‌تان را در کادر بالای همین صفحه هم جست‌وجو کنید تا به محصول و فروشگاه موردنظرتان برسید.',
      },
      {
        number: 1,
        id: 'request-2',
        img: juiceRequest2,
        title: 'انتخاب آبمیوه یا بستنی موردنظر',
        name: 'انتخاب خوراکی دلخواه',
        text:
          'آبمیوه ساده می‌خواهید یا بستنی محلی؟ شاید هم طرفدار بستنی ایتالیایی یا آبمیوه مخلوط چندمیوه هستید. لذت انتخاب و چشیدن طعم آبمیوه یا بستنی‌های جدید و متنوع را هم از دست ندهید. بعد از انتخاب نوشیدنی یا بستنی دلخواه، تعدادش را هم مشخص کنید و گزینه تکمیل خرید در پایین صفحه را بزنید.',
      },
      {
        number: 2,
        id: 'request-3',
        img: juiceRequest3,
        title: 'نوشتن توضیحات دلخواه برای سفارش',
        name: 'تکمیل سفارش دلخواه',
        text:
          'بستنی یا آبمیوه سفارشی‌تان را همان‌طور که دوست دارید، تحویل بگیرید. کافی است که در هنگام سفارش بگویید که چه می‌خواهید. سفارشتان مطابق میل و سلیقه‌تان، مخصوص شما آماده و فرستاده می‌شود. اگر بستنی‌تان را با خامه اضافه می‌خواهید یا طرف‌دار آبمیوه با یخ فراوان هستید، نظرتان را بگویید و منتظر دریافت سفارش باب میلتان باشید.',
      },
    ],
    dataCard: [],
    color: '#ff00a6',
  }

  const dataFooter = {
    img: juiceFooter,
    icon: food,
    title: 'سفارش آبمیوه و بستنی',
    text:
      'دلتان که آبمیوه یا بستنی خواست، هیچ لازم نیست که خودتان را به زحمت بیندازید. کافی است وارد اپلیکیشن اسنپ شوید و از بهترین‌ فروشگاه‌های اطراف سفارش بدهید. در میان گزینه‌های رنگارنگ بگردید و مورد دلخواه‌تان را پیدا کنید. خیلی زودتر از آنچه فکرش را می‌کنید، آبمیوه یا بستنی محبوبتان در بسته‌بندی مناسب و در مکان موردنظرتان به شما تحویل داده می‌شود. اسنپ هوای شما را دارد!',
    button: 'سفارش دهید',
  }

  const articleData = {
    items: [
      { id: 0, img: cityStar },
      { id: 1, img: tootFarangi },
      { id: 2, img: shaho },
      { id: 3, img: sajad },
      { id: 4, img: chaharfasl },
      { id: 5, img: bahar },
      { id: 6, img: a },
      { id: 7, img: valis },
    ],
    title: 'پرطرفدارترین آبمیوه و بستنی ها',
    cards: [
      {
        id: 0,
        bgc: '#ffffff',
        title: '',
        text:
          'بستنی و آبمیوه اگر از فروشگاه معتبر یا باسابقه خریداری نشود، جز پشیمانی از خرید نتیجه‌ای نخواهد داشت. بهترین آبمیوه و بستنی‌فروشی‌ها و بهترین برندهای فعال در سطح شهر در اپلیکیشن اسنپ حضور دارند تا به شما تجربه‌ای لذت‌بخش از یک دورهمی دوستانه یا مهمانی لوکس به‌همراه بستنی‌ها و آبمیوه‌های باکیفیت ببخشند یا عصرانه دلچسب شما را با انواع طعم‌های تازه و قدیمی تکمیل کنند.',
      },
      {
        id: 1,
        bgc: '#f5f5f6',
        title: 'انواع آبمیوه و بستنی',
        text:
          'دنیای بستنی‌ها و آبمیوه‌ها رنگی و متنوع است. این‌ها فراورده‌هایی از بهترین مواد خوراکی‌اند: لبنیات و میوه‌ها. کمتر کسی پیدا می‌شود که بستنی یا آبمیوه دوست نداشته باشد یا بالاخره طعم یکی از انواع و مدل‌های متنوع آنها را نپسندد. هرکدام از این دو دسته‌بندی خوراکی خوشمزه، انواع مختلفی دارند، برای مثال:',
      },
      {
        id: 2,
        bgc: '#ffffff',
        title: 'انواع آبمیوه طبیعی',
        text:
          'آبمیوه‌های طبیعی همان گزینه‌های جذابی هستند که هم طعم دلنشینی دارند و هم برای سلامتی مفید هستند. اگر دلتان می‌خواهد نوشیدنی خوشمزه‌ای نوش‌جان کنید که سالم و مقوی هم باشد، هیچ انتخابی بهتر از یک لیوان آبمیوه تازه و طبیعی نیست. آب هویج؟ سیب؟ نظرتان درباره یک لیوان آب انار خوش‌رنگ و خوشمزه چیست؟',
      },
      {
        id: 3,
        bgc: '#f5f5f6',
        title: 'آبمیوه‌های ترکیبی ',
        text:
          'بعضی میوه‌ها که پشت‌سرهم به صف و راهی آبمیوه‌گیری می‌شوند، خروجی جذابی وارد لیوانتان می‌شود که هم طعم جذاب‌تر دارد و هم خاصیت بیشتر. بعضی از آبمیوه‌های ترکیبی با حضور میوه‌های مختلف و آب گیاهانی مانند کرفس دنیایی از خاصیت و خوشمزگی را پیشکش شما می‌کنند. در واقع، ترکیب خوشمزه و مقوی‌شان باعث می‌شود که حتی آب میوه‌ها و گیاهانی با محبوبیت کم هم به‌یادماندنی شود.',
      },
      {
        id: 4,
        bgc: '#ffffff',
        title: 'اسموتی  ',
        text:
          'اسموتی‌ها دنیایی از انتخاب را پیش رویتان می‌گذارند. انواع میوه، یخ و شیرین‌کننده‌ای به میل و سلیقه‌تان اضافه کنید و بعد لیوانی از طعم‌های خوب را در اختیار خواهید داشت. ترکیب‌های مختلفی از میوه‌ها می‌توانند اسموتی‌های خوشمزه بسازند. همه‌چیز به سلیقه شما بستگی دارد.',
      },
      {
        id: 5,
        bgc: '#f5f5f6',
        title: 'کوکتل',
        text:
          'کوکتل‌ها هم از آبمیوه‌های ترکیبی هستند که به‌جز چند میوه می‌توانند مواد دیگری را هم به ترکیب‌شان راه بدهند. در کشورهای دیگر، در ترکیب کوکتل از میوه‌های مختلف و الکل استفاده می‌شود. در ایران، کوکتل‌ها معمولا ترکیب چند میوه و خوراکی‌های دیگری مانند خامه و شکلات هستند. دنیای کوکتل‌ها هم متنوع و رنگارنگ و البته خوشمزه است.',
      },
      {
        id: 6,
        bgc: '#ffffff',
        title: 'دیتاکس و سنتی‌ها ',
        text:
          'شاید این روزها نام نوشیدنی‌هایی با عنوان دیتاکس را بیشتر از قبل شنیده باشید. این‌روزها که توجه به تغذیه سالم بیشتر شده، حضور این نوشیدنی‌ها هم پررنگ‌تر از قبل به نظر می‌رسد. دیتاکس ترکیب آب است و میوه‌های مختلف. با قرارگرفتن میوه‌ها در آب و همراهی‌شان با یخ، طعم آب خوشایندتر می‌شود و نوشیدن آن به‌اندازه دست‌کم ۸ لیوان که همیشه توصیه می‌شود هم راحت‌تر از قبل خواهد بود.',
      },
    ],
  }
  return (
    <div>
      <Layout id='0'>
        <Slider dataSlider={dataSlider} />
        <IconBar />
        <Banner dataBanner={dataBanner} />
        <Section dataSection={dataSection} />
        <Article articleData={articleData} />
        <BannerFooter dataFooter={dataFooter} />
      </Layout>
    </div>
  )
}

export default Juice
